{
  "2024": [
    {
      "S.No": 201,
      "Authors": "Declan L. M. C, Simon L. L, Martin J. P. S., Hakeem K.R et al.",
      "Title": "Consistent Patterns of Common Species across Tropical Forest Tree Communities",
      "Journal": "Nature",
      "Year": 2024,
      "DOI": "https://doi.org/10.1038/s41586-023-06820-z",
      "Impact Factor": 50.500
    },
    {
      "S.No": 200,
      "Authors": "Shumei Xiao, Ferry Slik, Khalid Rehman Hakeem et al.",
      "Title": "Analogous environments across the tropics have similar levels of tree species alpha diversity",
      "Journal": "PNAS",
      "Year": 2024,
      "DOI": "Under Revision",
      "Impact Factor": 9.400
    },
    {
      "S.No": 199,
      "Authors": "Murad Muhammad, Abdul Wahab, Abdul Waheed, Heba Ibrahim Mohamed, Khalid Rehman Hakeem, Li Li, Wen-Jun Li",
      "Title": "Harnessing bacterial endophytes for environmental resilience and agricultural sustainability",
      "Journal": "Journal of Environmental Management",
      "Year": 2024,
      "DOI": "https://doi.org/10.1016/j.jenvman.2024.122201",
      "Impact Factor": 8.000
    },
    {
      "S.No": 198,
      "Authors": "Sheikh Altaf Hussain, Mohammad Anis, Hesham F Alharby, Khalid Rehman Hakeem",
      "Title": "In vitro regeneration potential of shoot tip explants, ex vitro rooting and phytochemical assessment of acetone leaf extracts of Tecoma stans L.",
      "Journal": "South African Journal of Botany",
      "Year": 2024,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0254629924002321",
      "Impact Factor": 3.100
    },
    {
      "S.No": 197,
      "Authors": "Triratnesh Gajbhiye, Ankesh Tiwari, Tanzil Gaffar Malik, Rashmi Dubey, Sudhir Kumar Pandey, Hesham F. Alharby, Khalid Rehman Hakeem",
      "Title": "SEM-EDS-based rapid measurement and size-fractionated speciation of airborne particulate matter and associated metals",
      "Journal": "Environmental Science and Pollution Research",
      "Year": 2024,
      "DOI": "https://link.springer.com/article/10.1007/s11356-024-34222-9",
      "Impact Factor": 5.800
    },
    {
      "S.No": 196,
      "Authors": "Fayaz Ahmad Dar, Inayatullah Tahir, Reiaz Ul Rehman, Hesham F. Alharby, Yahya Alzahrani, Hameed Alsamadany, Khalid Rehman Hakeem",
      "Title": "Exogenous silicon alleviates aluminum phytotoxicity in Fagopyrum esculentum Moench by modulating physiological and antioxidant responses",
      "Journal": "South African Journal of Botany",
      "Year": 2024,
      "DOI": "https://www.sciencedirect.com/science/article/abs/pii/S0254629924000929",
      "Impact Factor": 3.100
    },
    {
      "S.No": 195,
      "Authors": "Tombuloglu, G., Aldahnem, A., Tombuloglu, H., Khalid Rehman Hakeem",
      "Title": "Uptake and bioaccumulation of iron oxide nanoparticles (Fe3O4) in barley (Hordeum vulgare L.): effect of particle-size",
      "Journal": "Environmental Science and Pollution Research",
      "Year": 2024,
      "DOI": "https://doi.org/10.1007/s11356-024-32378-y",
      "Impact Factor": 5.800
    },
    {
      "S.No": 194,
      "Authors": "Asma Jabeen, Javid Iqbal Mir, Geetika Malik, Salwee Yasmeen, Shabeer Ahmad Ganie, Rozy Rasool, Khalid Rehman Hakeem",
      "Title": "Biotechnological interventions of improvement in cabbage (Brassica oleracea var. capitata L.)",
      "Journal": "Scientia Horticulturae",
      "Year": 2024,
      "DOI": "https://doi.org/10.1016/j.scienta.2024.112966",
      "Impact Factor": 4.300
    },
    {
      "S.No": 193,
      "Authors": "Marlene Vuillemin, Eduardo S. Moreno Prieto, Bo Pilgaard, Suzana Siebenhaar, Jesper Holck, Bernard Henrissat, Ahmad Bahieldin, Khalid Rehman Hakeem, Khalid M. Alghamdi",
      "Title": "Biochemical exploration of family GH119 reveals a single a-amylase specificity and confirms shared catalytic machinery with GH57 enzymes",
      "Journal": "International Journal of Biological Macromolecules",
      "Year": 2024,
      "DOI": "https://doi.org/10.1016/j.ijbiomac.2024.129783",
      "Impact Factor": 8.200
    },
    {
      "S.No": 192,
      "Authors": "Muzammil Shah, Hesham F. Alharby, Khalid Rehman Hakeem, Mohd Munawar",
      "Title": "A Comprehensive Review on Lantana camara: An Important Medicinal and Ornamental Plant",
      "Journal": "Life Sci J",
      "Year": 2024,
      "DOI": "http://www.lifesciencesite.com/lsj/lsj210324/",
      "Impact Factor": "N/A"
    }
  ],
  "2023": [
    {
      "S.No": 191,
      "Authors": "Ali Zari, Lina A. F. Kurdi, Fatima A. Jaber, Khalid M. S. Alghamdi, Talal A. Zari, Ahmed Bahieldin, Khalid Rehman Hakeem, Hanan S. Alnahdi, Sherif Edris & Ghulam Md Ashraf",
      "Title": "Investigation and drug design for novel molecules from natural products as inhibitors for controlling multiple myeloma disease using in-silico tools",
      "Journal": "Journal of Biomolecular Structure and Dynamics",
      "Year": 2023,
      "DOI": "https://www.tandfonline.com/doi/full/10.1080/07391102.2023.2300409",
      "Impact Factor": 4.400
    },
    {
      "S.No": 190,
      "Authors": "Seerat Saleem, Khalid M. Alghamdi, Naveed Ul Mushtaq, Inayatullah Tahir, Ahmad Bahieldin, Bernard Henrissat, Mohammad K. Alghamdi, Reiaz Ul Rehman and Khalid Rehman Hakeem",
      "Title": "Computational and experimental analysis of foxtail millet under salt stress and selenium supplementation",
      "Journal": "Environmental Science and Pollution Research",
      "Year": 2023,
      "DOI": "https://doi.org/10.1007/s11356-023-30364-4",
      "Link": "https://link.springer.com/article/10.1007/s11356-023-30364-4",
      "Impact Factor": 5.800
    },
    {
      "S.No": 189,
      "Authors": "Wafaa S. Ramadan, Saleh Alkarim, Mohammed Moulay, Ghadeer Alrefeai, Fatma Alkudsy, Khalid Rehman Hakeem and Ashwaq Iskander",
      "Title": "Modulation of the Tumor Microenvironment by Ellagic Acid in Rat Model for Hepatocellular carcinoma: A Potential Target against Hepatic Cancer Stem Cells",
      "Journal": "Cancers",
      "Year": 2023,
      "DOI": "https://doi.org/10.3390/cancers15194891",
      "Link": "https://www.mdpi.com/2072-6694/15/19/4891",
      "Impact Factor": 5.200
    },
    {
      "S.No": 188,
      "Authors": "Seerat Saleem, Naveed Ul Mushtaq, Wasifa Hafiz Shah, Aadil Rasool, Khalid Rehman Hakeem, Chandra Shekhar Seth, Inayatullah Tahir, Reiaz Ul Rehman",
      "Title": "Millets as smart future food with essential phytonutrients for promoting health",
      "Journal": "Journal of Food Composition and Analysis",
      "Year": 2023,
      "DOI": "https://doi.org/10.1016/j.jfca.2023.105669",
      "Link": "https://www.sciencedirect.com/science/article/abs/pii/S0889157523005434",
      "Impact Factor": 4.300
    },
    {
      "S.No": 187,
      "Authors": "Mahak Naveed, Maria Ghaffar, Zafran Khan, Nimra Gul, Iram Ijaz, Amir Bibi, Soha Pervaiz, Hesham F Alharby, Muhammad Sayyam Tariq, Syed Riaz Ahmed, Khalid Rehman Hakeem, Daniel KY Tan",
      "Title": "Morphological and Structural Responses of Albizia lebbeck to Different Lead and Nickel stress levels",
      "Journal": "Agriculture",
      "Year": 2023,
      "DOI": "https://doi.org/10.3390/agriculture13071302",
      "Impact Factor": 3.600
    },
    {
      "S.No": 186,
      "Authors": "Ahmed SR, Ali Z, Ijaz I, Khan Z, Gul N, Pervaiz S, Alharby HF, Tan DKY, Tariq MS, Ghaffar M, Amir Bibi and Khalid Rehman Hakeem",
      "Title": "Multi-Trait Selection of Quinoa Ideotypes at Different Levels of Cutting and Spacing",
      "Journal": "Sustainability",
      "Year": 2023,
      "DOI": "https://doi.org/10.3390/su151411446",
      "Link": "https://www.mdpi.com/2071-1050/15/14/11446",
      "Impact Factor": 3.900
    },
    {
      "S.No": 185,
      "Authors": "Khalid Rehman Hakeem, Hesham F. Alharby, M. Irfan Qureshi",
      "Title": "Drought-mediated modulation in metabolomic profiling of Nigella sativa leaf, growth, ecophysiology and antioxidants",
      "Journal": "Phyton- International Journal of Experimental Botany",
      "Year": 2023,
      "Link": "https://www.techscience.com/phyton/v92n12/55000",
      "Impact Factor": 1.700
    },
    {
      "S.No": 184,
      "Authors": "Irfan A. Rather, Mohammad Younus Wani, Majid Rasool Kamli, Jamal S. M. Sabir, Khalid Rehman Hakeem, Ahmad Firoz, Yong Ha Park and Yan Yan Hor",
      "Title": "Limosilactobacillus fermentum KAU0021 abrogates mono- and polymicrobial biofilms formed by Candida albicans and Staphylococcus aureus",
      "Journal": "Pharmaceutics",
      "Year": 2023,
      "DOI": "https://doi.org/10.3390/pharmaceutics15041079",
      "Link": "https://www.mdpi.com/1999-4923/15/4/1079",
      "Impact Factor": 6.525
    },
    {
      "S.No": 183,
      "Authors": "Hesham F. Alharby, Shafaqat Ali, Hassan S. Al-Zahrani and Khalid Rehman Hakeem",
      "Title": "Alleviation of cadmium toxicity by using trehalose as a plant growth regulator in wheat",
      "Journal": "Turkish Journal of Agriculture and Forestry",
      "Year": 2023,
      "DOI": "10.55730/tar-2301-10",
      "Link": "https://journals.tubitak.gov.tr/cgi/viewcontent.cgi?article=3092&context=agriculture",
      "Impact Factor": 2.669
    },
    {
      "S.No": 182,
      "Authors": "Wasifa Hafz Shah, Aadil Rasool, Sajad Ahmad Padder, Roshan Kumar Singh, Manoj Prasad, Inayatullah Tahir, Reiaz ul Rehman and Khalid Rehman Hakeem",
      "Title": "Decarboxylation mechanisms of the C4 cycle in foxtail millet observed under salt and selenium treatments",
      "Journal": "Plant Growth Regulation",
      "Year": 2023,
      "DOI": "https://link.springer.com/article/10.1007/s10725-022-00888-9",
      "Impact Factor": 3.412
    },
    {
      "S.No": 181,
      "Authors": "Sameera A. Alghamdi; Hesham F. Alharby; Mahmoud A. Abdelfattah; Ibrahim A.A. Mohamed; Khalid R. Hakeem; Mostafa M. Rady; Ahmed Shaaban",
      "Title": "Spirulina platensis-inoculated humified compost boosts rhizosphere soil hydro-physico-chemical properties and Atriplex nummularia forage yield and quality in an arid saline-calcareous soil",
      "Journal": "Journal of Soil Science and Plant Nutrition",
      "Year": 2023,
      "DOI": "https://doi.org/10.1007/s42729-023-01174-x",
      "Link": "https://link.springer.com/article/10.1007/s42729-023-01174-x",
      "Impact Factor": 3.600
    },
    {
      "S.No": 180,
      "Authors": "Naveed Ul Mushtaq, Khalid M. Alghamdi, Seerat Saleem, Inayatullah Tahir, Ahmad Bahieldin, Bernard Henrissat, Mohammad Khalid Alghamdi, Reiaz Ul Rehman and Khalid Rehman Hakeem",
      "Title": "Exogenous Zinc mitigates salinity stress by stimulating proline metabolism in proso millet (Panicum miliaceum L.)",
      "Journal": "Frontiers in Plants Science",
      "Year": 2023,
      "DOI": "https://www.frontiersin.org/articles/10.3389/fpls.2023.1053869/abstract",
      "Impact Factor": 6.627
    },
    {
      "S.No": 179,
      "Authors": "Saqib Hussain, Amna R. Ghafour, Rafiq Ahmad, Irfan Ali, Khalid M. Alghamdi, Iram Ijaz, Ibtisam Y. Dhabih",
      "Title": "Phytochemical and Pharmacological Evaluation of the Methanol Extract of Chrozophora oblongifolia (Decne) Roots",
      "Journal": "Molecules",
      "Year": 2023,
      "DOI": "https://doi.org/10.3390/molecules28144493",
      "Link": "https://www.mdpi.com/1420-3049/28/14/4493",
      "Impact Factor": 4.600
    }
  ],
  "2022": [
    {
      "S.No": 178,
      "Authors": "Irfan A. Rather, Lee-Ching Lew, Majid Rasool Kamli, Jamal S. M. Sabir, Khalid Rehman Hakeem, Yong Ha Park, Yan Yan Hor",
      "Title": "The Inhibition of SARS-CoV-2 and the Modulation of Inflammatory Responses by the Probio65 Extract of Lactobacillus sakei",
      "Journal": "Vaccines",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/vaccines10122106",
      "Impact Factor": 4.961
    },
    {
      "S.No": 177,
      "Authors": "Chakrabartty, I., Hakeem, K.R., Mohanta, Y.K., Varma, R.S.",
      "Title": "Greener nanomaterials and their diverse applications in the energy sector",
      "Journal": "Clean Technologies and Environmental Policy",
      "Year": 2022,
      "DOI": "https://link.springer.com/article/10.1007/s10098-022-02368-0",
      "Impact Factor": 4.700
    },
    {
      "S.No": 176,
      "Authors": "Irfan A. Rather, Mohammad Younus Wani, Majid Rasool Kamli, Jamal S. M. Sabir, Khalid Rehman Hakeem, Ahmad Firoz, Yong Ha Park, Yan Yan Hor",
      "Title": "Lactiplantibacillus plantarum KAU007 Extract Modulates Critical Virulence Attributes and Biofilm Formation in Sinusitis Causing Streptococcus pyogenes",
      "Journal": "Pharmaceutics",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/pharmaceutics14122702",
      "Impact Factor": 6.525
    },
    {
      "S.No": 175,
      "Authors": "Naveed Ul Mushtaq, Khalid M. Alghamdi, Seerat Saleem, Faamiya Shajar, Inayatullah Tahir, Ahmad Bahieldin, Reiaz Ul Rehman, Khalid Rehman Hakeem",
      "Title": "Selenate and selenite transporters in Proso millet: Genome extensive detection and expression studies under salt stress and selenium",
      "Journal": "Frontiers in Plant Science",
      "Year": 2022,
      "DOI": "https://doi.org/10.3389/fpls.2022.1060154",
      "Impact Factor": 6.627
    },
    {
      "S.No": 174,
      "Authors": "Bisma Malik, Fayaz Ahmad Dar, Tanveer Bilal Pirzadah, Ali Zari, Talal Ali Zari, Hesham Alharby, Khalid Rehman Hakeem, Reiaz Ul Rehman",
      "Title": "Molecular and Phytochemical Characterizations of Cichorium intybus L. in Diverse Ecogeographical Regions of Kashmir Himalaya",
      "Journal": "Applied Sciences",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/app122312061",
      "Impact Factor": 2.838
    },
    {
      "S.No": 173,
      "Authors": "Muhammad Habib-ur-Rahman, Ashfaq Ahmad, Ahsan Raza, Hashem F. Alharby, Yahya M. Alzahrani, Atif A. Bamagoos, Khalid Rehman Hakeem, Muhammad Usama Hasnain, Saeed Ahmad, Wajid Nasim, Shafaqat Ali, Fatma Mansour, Ayman EL Sabagh",
      "Title": "Impact of climate change on agricultural production; Issues, challenges, and opportunities in Asia",
      "Journal": "Frontiers in Plant Science",
      "Year": 2022,
      "DOI": "https://doi.org/10.3389/fpls.2022.925548",
      "Impact Factor": 6.627
    },
    {
      "S.No": 172,
      "Authors": "Farkhanda Bibi, Durairaj Balasubramanian, Muhammad Ilyas, Jan Sher, Hamz Ali Samoon, Muhammad Hayder Bin Khalid, Hesham F. Alharby, Ali Majrashi, Sameera A. Alghamdi, Khalid Rehman Hakeem, Muddaser Shah, Shabir A. Rather",
      "Title": "Seasonal Variations of Fine Root Dynamics in Rubber-Flemingia macrophylla Intercropping System in Southwestern China",
      "Journal": "Plants",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/plants11202682",
      "Impact Factor": 4.658
    },
    {
      "S.No": 171,
      "Authors": "Muhammad Muzammal, Ahmad Firoz, Hani Mohammed Ali, Arshad Farid, Muzammil Ahmad Khan, Khalid Rehman Hakeem",
      "Title": "Lumateperone interact with S-protein of Ebola Virus and TIM-1 of human cell membrane: Insights from computational studies",
      "Journal": "Applied Sciences",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/app12178820",
      "Impact Factor": 2.838
    },
    {
      "S.No": 170,
      "Authors": "Fayaz Ahmad Dar, Naveed Ul Mushtaq, Seerat Saleem, Reiaz Ul Rehman, Tanvir Ul Hassan Dar, Khalid Rehman Hakeem",
      "Title": "Role of Epigenetics in Modulating Phenotypic Plasticity against Abiotic Stresses in Plants",
      "Journal": "International Journal of Genomics",
      "Year": 2022,
      "DOI": "https://doi.org/10.1155/2022/1092894",
      "Impact Factor": 2.326
    },
    {
      "S.No": 169,
      "Authors": "Aadil Rasool, Wasifa Hafiz Shah, Sajad Ahmad Padder, Inayatullah Tahir, Hesham F. Alharby, Khalid Rehman Hakeem, Reiaz ul Rehman",
      "Title": "Exogenous selenium treatment alleviates salinity stress in Proso Millet (Panicum miliaceum L.) by enhancing the antioxidant defence system and regulation of ionic channels",
      "Journal": "Plant Growth Regulation",
      "Year": 2022,
      "DOI": "https://link.springer.com/article/10.1007/s10725-022-00826-9",
      "Impact Factor": 3.412
    },
    {
      "S.No": 168,
      "Authors": "Mohammed Idreesh Khan, Md Faruque Ahmad, Sachil Kumar, Shadma Wahab, Fauzia Ashfaq, Abdulrahman A. Alsayegh, Khalid Rehman Hakeem",
      "Title": "Arsenic Exposure through Dietary Intake and Associated Health Hazards in the Middle East: A Comprehensive Review",
      "Journal": "Nutrients",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/nu14102136",
      "Impact Factor": 5.719
    },
    {
        "S.No": 167,
        "Authors": "Hassan S. Al-Zahrani, Kamrun Nahar, Hesham F. Alharby, Hameed Alsamadany, Khalid Rehman Hakeem and Mirza Hasanuzzaman",
        "Title": "Zinc Supplementation Enhances Glutathione-Mediated Antioxidant Defense and Glyoxalase Systems to Conferring Salt Tolerance in Soybean (Glycine max L.)",
        "Journal": "Agronomy",
        "Year": 2022,
        "DOI": "https://doi.org/10.3390/agronomy12051032",
        "Impact Factor": 3.417
    },
    {
        "S.No": 166,
        "Authors": "Shilpa Raina, Vikas Sharma, Zahid Nabi Sheikh, Navneet Kour, Shashank K Singh, Ali Zari, Talal Ali Zari, Hesham Alharby and Khalid Rehman Hakeem",
        "Title": "Anticancer activity of Cordia dichotoma parts against a panel of human cancer cell lines and their phytochemical profiling via HPLC and GCMS",
        "Journal": "Plants Basel",
        "Year": 2022,
        "DOI": "https://www.mdpi.com/1420-3049/27/7/2185",
        "Impact Factor": 3.935
    },
    {
        "S.No": 165,
        "Authors": "Khalid Rehman Hakeem, Hesham F. Alharby and Peerzada Tanveer Bilal",
        "Title": "Exogenously applied calcium regulates antioxidative system and reduces cadmium-uptake in Fagopyrum esculentum",
        "Journal": "Plant Physiology and Biochemistry",
        "Year": 2022,
        "DOI": "https://www.sciencedirect.com/science/article/abs/pii/S0981942822001255",
        "Impact Factor": 4.270
    },
    {
        "S.No": 164,
        "Authors": "Rahman Ullah Khan, Shefaat Ullah Shah, Sheikh Abdur Rashid, Faiza Naseem, Kifayat Ullah Shah, Arshad Farid, Khalid Rehman Hakeem, Majid Rasool Kamili, Eman Hillal Althubaiti and Soha A Alamoudi",
        "Title": "Lornoxicam-Loaded Chitosan-Decorated Nanoemulsion: Preparation and In Vitro Evaluation for Enhanced Transdermal Delivery",
        "Journal": "Polymers",
        "Year": 2022,
        "DOI": "https://doi.org/10.3390/polym14091922",
        "Impact Factor": 4.329
    },
    {
        "S.No": 163,
        "Authors": "Hirdayesh Anuragi, Rajesh Kumar Singhal, Ambati Srijan, Alka Bharati, Lal Chand, Sukumar Taria, Rajarajan K, Asha Ram, Khalid Rehman Hakeem and Ayman EL SABAGH",
        "Title": "The Primacy of Moringa (Moringa oleifera Lam) in Boosting Nutrition Status and Immunity Defence Amidst the COVID-19 Catastrophe",
        "Journal": "Phyton- International Journal of Experimental Botany",
        "Year": 2022,
        "DOI": "https://www.techscience.com/phyton/v91n9/47715",
        "Impact Factor": 1.039
    },
    {
        "S.No": 162,
        "Authors": "Bakht amin, Muhammad Jawaad Atif, Huanwen Meng, Muhammad Ali, Xiuju Li, Hesham Alharby, Ali Majrashi, Khalid Rehman Hakeem, Monika Koul, Zhihui Cheng",
        "Title": "Melatonin Rescues Photosynthesis and Triggers Antioxidant Defense Response in Cucumis sativus Plants Challenged by Low Temperature and High Humidity",
        "Journal": "Frontiers in Plant Science",
        "Year": 2022,
        "DOI": "http://www.frontiersin.org/Journal/Abstract.aspx?d=0&name=Plant_Breeding&ART_DOI=10.3389/fpls.2022.855900",
        "Impact Factor": 5.753
    },
    {
        "S.No": 161,
        "Authors": "Muhammad Imran Ghani, Shabir A. Rather, Ahmad Ali, Muhammad J. Atif, Muhammad Ali, Mohammad A. Ahanger, Bakht Amin, Maha Aljabri, Sherif Idris, Khalid R. Hakeem and Zhihui Cheng",
        "Title": "Leaf functional traits and physiological growth parameter facilitate adaption of invasive plants to Cd stress in comparison to natives",
        "Journal": "Frontiers in Plant Science",
        "Year": 2022,
        "DOI": "https://www.frontiersin.org/articles/10.3389/fpls.2022.869072/abstract",
        "Impact Factor": 5.753
    },
    {
        "S.No": 160,
        "Authors": "Sayyada Bushra, Shahla Faizan, Zeenat Mushtaq, Alisha Hussain and Khalid Rehman Hakeem",
        "Title": "Effect of Cadmium Stress on the Growth, Physiology, Stress Markers, Antioxidants and Stomatal Behaviour of Two Genotypes of Chickpea (Cicer arietinum L.)",
        "Journal": "Phyton- International Journal of Experimental Botany",
        "Year": 2022,
        "DOI": "https://www.techscience.com/phyton/v91n9/47711",
        "Impact Factor": 1.039
    },
    {
        "S.No": 159,
        "Authors": "Aadil Rasool, Wasifa Hafiz Shah, Naveed Ul Mushtaq, Seerat Saleem, Khalid Rehman Hakeem and Reiaz ul Rehman",
        "Title": "Amelioration of Salinity Induced Damage in Plants by Selenium Application: A Review",
        "Journal": "South African Journal of Botany",
        "Year": 2022,
        "DOI": "https://www.sciencedirect.com/science/article/abs/pii/S0254629921005470",
        "Impact Factor": 2.315
    },
    {
        "S.No": 158,
        "Authors": "Rauoof Ahmad Rather, Haleema Bano, Ahmad Firoz, Hani Mohammed Ali, Mohd Ashraf Bhat, Shahid Ahmad Padder, Huda Nafees and Khalid Rehman Hakeem",
        "Title": "The Assessment of Morphological Diversity of Colchicum luteum L. an Economically Important Threatened Medicinal Plant of Kashmir Himalaya",
        "Journal": "Sustainability",
        "Year": 2022,
        "DOI": "https://doi.org/10.3390/su14031327",
        "Impact Factor": 3.251
    },
    {
        "S.No": 157,
        "Authors": "Mahak Majeed, Khalid Rehman Hakeem and Reiaz Ul Rehman",
        "Title": "Synergistic effect of plant extract coupled silver nanoparticles in various therapeutic applications- present insights and bottlenecks",
        "Journal": "Chemosphere",
        "Year": 2022,
        "DOI": "https://www.sciencedirect.com/science/article/abs/pii/S0045653521029994",
        "Impact Factor": 7.086
    },
    {
        "S.No": 156,
        "Authors": "Rouf Ahmad Bhat, Dig Vijay Singh, Humaira Qadri, Gowhar Hamid Dar, Moonisa Aslam Dervash, Mohammad Aneesul Mehmood, Shakeel Ahmad Bhat, Bengu Turkyilmaz Unal, Munir Ozturk, Khalid Rehman Hakeem and Balal Yousaf",
        "Title": "Vulnerability of municipal solid waste: An emerging threat to aquatic ecosystems",
        "Journal": "Chemosphere",
        "Year": 2022,
        "DOI": "https://www.sciencedirect.com/science/article/pii/S0045653521026953",
        "Impact Factor": 7.086
    },
    {
        "S.No": 155,
        "Authors": "Zeenat Mushtaq, Shahla Faizan, Basit Gulzar, Sayyada Bushra, Alisha Hussain and Khalid Rehman Hakeem",
        "Title": "Effect of salt stress on growth, photosynthetic pigments, cell viability, lipid peroxidation and antioxidant defence system in two varieties of chickpea (Cicer arietinum L.)",
        "Journal": "Phyton- International Journal of Experimental Botany",
        "Year": 2022,
        "DOI": "https://www.techscience.com/phyton/v91n1/44073",
        "Impact Factor": 1.039
    },
    {
        "S.No": 154,
        "Authors": "Khalid Rehman Hakeem*, Hesham F. Alharby, Atef Bamagoos and Tanveer Bilal Peerzada",
        "Title": "Biochar promotes arsenic (As) immobilization in contaminated soils and alleviates the As-toxicity in soybean (Glycine max (L.) Merr.)",
        "Journal": "Chemosphere",
        "Year": 2022,
        "DOI": "https://www.sciencedirect.com/science/article/pii/S0045653521038819",
        "Impact Factor": 7.086
    },
    {
        "S.No": 153,
        "Authors": "Tarun Kumar Upadhyay, Varun Kumar VS, Amit Baran Sharangi, Vijay J. Upadhye, Fahad Khan, Khalid Rehman Hakeem*",
        "Title": "Nanotechnology-Based Advancements in Post-Harvest Management of Horticultural crops",
        "Journal": "Phyton- International Journal of Experimental Botany",
        "Year": 2022,
        "DOI": "https://www.techscience.com/phyton/online/detail/18276",
        "Impact Factor": 1.039
    },
    {
        "S.No": 152,
        "Authors": "Misbah Naz, Rubab Shabbir, Krishan K. Verma, Anshu Rastogi, Vishnu D. Rajput, Talha Javed, Muhammad Ammar Raza, Kainat Asif, Muhammad Aamir Iqbal, Muhammad Imran, Mohammad Sohidul Islam, Khalid Rehman Hakeem*, Mehmet Firat Baran and Ayman EL Sabagh",
        "Title": "Recent Developments to Mitigate Selenium Deficiency in Agricultural Eco-Systems",
        "Journal": "Phyton- International Journal of Experimental Botany",
        "Year": 2022,
        "DOI": "https://www.techscience.com/phyton/v91n5/46603",
        "Impact Factor": 1.039
    },
    {
        "S.No": 151,
        "Authors": "Divya Jain, Rajib Hossain, Rasel Ahmed Khan, Dipta Dey, Tanzila Rahman Toma, Mohammad Torequl Islam, Pracheta Janmeda, Khalid Rehman Hakeem*",
        "Title": "Computer-aided Evaluation of Anti-SARS-CoV-2 (3- chymotrypsin-like Protease and Transmembrane Protease Serine 2 Inhibitors) Activity of Cepharanthine: An In silico Approach",
        "Journal": "Biointerface Research in Applied Chemistry",
        "Year": 2022,
        "DOI": "https://biointerfaceresearch.com/wpcontent/uploads/2021/04/20695837121.768780.pdf",
        "Impact Factor": null
    },
    {
        "S.No": 149,
        "Authors": "Maryam Khan, Muhammad Saeed Ahmed Khan, Kabari Krishna Borah, Yashodhara Goswami, Khalid Rehman Hakeem, Ishani Chakrabartty",
        "Title": "The potential exposure and hazards of metal-based nanoparticles on plants and environment: A review",
        "Journal": "Environmental Advances",
        "Year": 2022,
        "DOI": "https://www.sciencedirect.com/science/article/pii/S2666765721000995",
        "Impact Factor": null
    },
    {
        "S.No": 148,
        "Authors": "Nouf Ali Asiri, Waseem Mushtaq, Hassan Saeed Al-Zahrani, Hesham F. Alharby and Khalid Rehman Hakeem",
        "Title": "Assessment of phytoremediation potential of Dianthus sp. and Ocimum basilicum",
        "Journal": "International Journal of Applied Science and Research",
        "Year": 2022,
        "DOI": null,
        "Impact Factor": null
    },
    {
        "S.No": 147,
        "Authors": "Taqi Raza, Muhammad Shehzad, Muhammad Farhan Qadir, Hafiz Abdul Kareem, Neal S. Eash, Mika Sillanpaa, Khalid Rehman Hakeem",
        "Title": "Indirect effects of Covid-19 on water quality",
        "Journal": "Water-Energy Nexus",
        "Year": 2022,
        "DOI": "https://www.sciencedirect.com/science/article/pii/S2588912522000030",
        "Impact Factor": null
    },
    {
        "S.No": 146,
        "Authors": "Waleed Al Saadi, Atif Bamagoos and Khalid Rehman Hakeem",
        "Title": "Phytochemical analysis and antibacterial activities of Avicennia marina (Forssk.) Vierh. extracts against Vancomycin-resistant Enterococcus faecium",
        "Journal": "Advances in Environmental Biology",
        "Year": 2022,
        "DOI": "Chrome extension://efaidnbmnnnibpcajpcglclefindmkaj/http://www.aensiweb.net/AENSIWEB/aeb/aeb/2022/Sept/5-12(2).pdf",
        "Impact Factor": null
    }
],
"2021": [
    {
      "S.No": 145,
      "Authors": "Khalid Rehman Hakeem*, Hesham Alharby, Khalid M. Alghamdi and Rouf Ahmad Bhat",
      "Title": "Antioxidant enzyme responses and metabolite functioning of Pisum sativum L. to sewage sludge in arid and semi-arid environments",
      "Journal": "Environmental Science and Pollution Research",
      "Year": 2021,
      "DOI": "https://link.springer.com/article/10.1007/s11356-021-16620-5",
      "Impact Factor": 4.223
    },
    {
      "S.No": 144,
      "Authors": "Ali T. Zari, Talal A. Zari, Khalid Rehman Hakeem*",
      "Title": "Anticancer Properties of Eugenol - A Review",
      "Journal": "Molecules",
      "Year": 2021,
      "DOI": "https://www.mdpi.com/1420-3049/26/23/7407",
      "Impact Factor": 4.411
    },
    {
      "S.No": 143,
      "Authors": "Sheikh Abdur Rashid, Sajid Bashir, Faiza Naseem, Arshad Farid, Irfan A. Rather and Khalid Rehman Hakeem",
      "Title": "Olive Oil Based Methotrexate Loaded Topical Nanoemulsion Gel for the Treatment of Imiquimod Induced Psoriasis-Like Skin Inflammation in an Animal Model",
      "Journal": "Biology",
      "Year": 2021,
      "DOI": "https://doi.org/10.3390/biology10111121",
      "Impact Factor": 5.079
    },
    {
      "S.No": 142,
      "Authors": "Zahid Nabi Sheikh, Vikas Sharma, Rafiq Ahmad Shah, Shilpa Rania, Maha Aljabri, Javid I Mir, Naser Alkenani, Khalid Rehman Hakeem*",
      "Title": "Elucidating the genetic diversity in Apricot (Prunus armeniaca L.) cultivated in the North-Western Himalayan provinces of India by using SSR markers",
      "Journal": "Plants",
      "Year": 2021,
      "DOI": "https://www.mdpi.com/2223-7747/10/12/2668",
      "Impact Factor": 3.935
    },
    {
      "S.No": 141,
      "Authors": "Peerzada Yasir Yousuf, Peerzada Arshid Shabir, Khalid Rehman Hakeem",
      "Title": "miRNAomic approach to plant nitrogen starvation",
      "Journal": "International Journal of Genomics",
      "Year": 2022,
      "DOI": "https://www.hindawi.com/journals/ijg/2021/8560323/",
      "Impact Factor": 2.326
    },
    {
      "S.No": 140,
      "Authors": "Fayaz Ahmad Dar, Inayatullah Tahir, Sameer H. Qari, Aala A. Abulfaraj, Maha Aljabri, Hesham F. Alharby, Khalid Rehman Hakeem*, and Reiaz-Ul Rehman",
      "Title": "Molecular characterization and population genetic structure of Fagopyrum species cultivated in North-Western Himalayan regions",
      "Journal": "Sustainability",
      "Year": 2021,
      "DOI": "https://www.mdpi.com/2071-1050/13/21/12165",
      "Impact Factor": 3.251
    },
    {
      "S.No": 139,
      "Authors": "Fayaz Ahmad Dar, Inayatullah Tahir, Khalid Rehman Hakeem, Reiaz-Ul Rehman",
      "Title": "Silicon application enhances the photosynthetic pigments, phenolic/flavonoid content by modulating the phenylpropanoid pathway in common buckwheat under aluminum stress",
      "Journal": "Silicon",
      "Year": 2022,
      "DOI": "https://link.springer.com/article/10.1007/s12633-021-01501-w",
      "Impact Factor": 2.670
    },
    {
      "S.No": 138,
      "Authors": "Hesham F. Alharby, Kamrun Nahar, Hassan S. Al-Zahrani, Khalid Rehman Hakeem and Mirza Hasanuzzaman",
      "Title": "Enhancing Salt Tolerance in Soybean by Exogenous Boron: Intrinsic Study of the Ascorbate-Glutathione and Glyoxalase Pathways",
      "Journal": "Plants",
      "Year": 2021,
      "DOI": "https://doi.org/10.3390/plants10102085",
      "Impact Factor": 3.935
    },
    {
      "S.No": 137,
      "Authors": "Irfan A. Rather, Sy-Bing Choi, Majid K. Kamli, Khalid Rehman Hakeem, Jamal S.M. Sabir and Yong-Ha Park, Yan Yan Hor",
      "Title": "Lactobacillus plantarum Probio-88 postbiotics as potential adjuvant therapeutic against SARS-CoV-2",
      "Journal": "Vaccines",
      "Year": 2021,
      "DOI": "https://doi.org/10.3390/vaccines9101067",
      "Impact Factor": 4.422
    },
    {
      "S.No": 136,
      "Authors": "Tanzeela Kokab, Hafiza Sumbal Ashraf, Muhammad Bilal Shakoor, Asim Jilani, Sajid Rashid Ahmad, Muzaffar Majid, Shafaqat Ali, Nazar Farid, Rana A. Alghamdi, Diana A. H. Al-Quwaie and Khalid Rehman Hakeem",
      "Title": "Effective Removal of Cr(VI) from Wastewater Using Biochar Derived from Walnut Shell",
      "Journal": "Int. J. Environ. Res. Public Health",
      "Year": 2021,
      "DOI": "https://doi.org/10.3390/ijerph18189670",
      "Impact Factor": 3.390
    },
    {
      "S.No": 135,
      "Authors": "Adnan Shakeel, Abrar Ahmad Khan, Hesham F. Alharby, Atif A. Bamagoos, Nadiyah M. Alabdallah and Khalid Rehman Hakeem*",
      "Title": "Optimizing Nitrogen Application in Root Vegetables from Their Growth, Biochemical and Antioxidant Response to Urea Fertilizer",
      "Journal": "Agriculture",
      "Year": 2021,
      "DOI": "https://doi.org/10.3390/agriculture11080704",
      "Impact Factor": 2.925
    },
    {
      "S.No": 134,
      "Authors": "Mahak Majeed, Tanveer Bilal Pirzadah, Manzoor Ahmad Mir, Khalid Rehman Hakeem*, Hesham F. Alharby, Hameed Alsamadany, Atif A. Bamagoos and Reiaz Ul Rehman",
      "Title": "Comparative Study on Phytochemical Profile and Antioxidant Activity of an Epiphyte, Viscum album L. (White Berry Mistletoe), Derived from Different Host Trees",
      "Journal": "Plants",
      "Year": 2021,
      "DOI": "https://doi.org/10.3390/plants10061191",
      "Impact Factor": 3.935
    },
    {
      "S.No": 133,
      "Authors": "Shamsul HAQ, Ram BHAROSE, Rouf A. BHAT, Munir OZTURK, Volkan ALTAY, Asma A. BHATTI, Moonisa Aslam DERVASH and Khalid R. HAKEEM",
      "Title": "Impact of treated sewage water on nutrient status of alfisols and vegetable crops",
      "Journal": "Notulae Botanicae Horti Agrobotanici",
      "Year": 2021,
      "DOI": "https://doi.org/10.15835/nbha49212255",
      "Impact Factor": 1.444
    },
    {
      "S.No": 132,
      "Authors": "Hassan S. Al-Zahrani, Hesham F. Alharby, Khalid Rehman Hakeem* and Reiaz Ul Rehman",
      "Title": "Exogenous Application of Zinc to mitigate the salt stress in Vigna radiata (L.) Wilczek - Evaluation of Physiological and Biochemical processes",
      "Journal": "Plants",
      "Year": 2021,
      "DOI": "https://doi.org/10.3390/plants10051005",
      "Impact Factor": 3.935
    },
    {
      "S.No": 131,
      "Authors": "Hesham F. Alharby, Hassan S. Al-Zahrani, Yahya M. Alzahrani, Hameed Alsamadany and Khalid Rehman Hakeem",
      "Title": "The Role of Exogenous Calcium in Mitigating the Impact of Salinity on Growth, Photosynthesis, and Biochemical Properties of Soybean",
      "Journal": "Plants",
      "Year": 2021,
      "DOI": "https://doi.org/10.3390/plants10010016",
      "Impact Factor": 3.935
    }
  ],
  "2022": [
    {
      "S.No": 130,
      "Authors": "Khalid Rehman Hakeem*, Tanzeela Kokab, Muhammad I. Awan, Afifa Arif, Muhammad W. N. Bashir, Zeeshan A. Niyaz, Ewa W. Karpinska, Jamil H. Awan, Yasir A. G. Hakeem, Mohamad A. Othman, Muhammad M. Sadiq",
      "Title": "A Review on Bioremediation: Harnessing the Potential of Bacteria to Tackle Heavy Metal Pollution",
      "Journal": "Sustainability",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/su14116557",
      "Impact Factor": 3.251
    },
    {
      "S.No": 129,
      "Authors": "Zahid Nabi Sheikh, Vikas Sharma, Muneeb Ali Shah, Hesham Alharby, Khalid Rehman Hakeem*",
      "Title": "Genome-Wide Identification of Major Genes Associated with Ascorbic Acid Content in Prunus armeniaca L. Using RNA-Seq",
      "Journal": "Antioxidants",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/antiox11101954",
      "Impact Factor": 6.444
    },
    {
      "S.No": 128,
      "Authors": "Ali T. Zari, Talal A. Zari, Khalid Rehman Hakeem*",
      "Title": "Anticancer Properties of Carvacrol - A Review",
      "Journal": "Molecules",
      "Year": 2022,
      "DOI": "https://www.mdpi.com/1420-3049/27/3/703",
      "Impact Factor": 4.411
    },
    {
      "S.No": 127,
      "Authors": "Irfan A. Rather, Khalid Rehman Hakeem, Jaewon Lee and Yong-Ha Park",
      "Title": "Synthesis and Characterization of Silver Nanoparticles Using Natural Polyphenolic Extract from Buckwheat",
      "Journal": "Nanomaterials",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/nano12061042",
      "Impact Factor": 5.719
    },
    {
      "S.No": 126,
      "Authors": "Aneesa Saleem, Khalid Rehman Hakeem* and Ibrar Ahmad",
      "Title": "Application of Phytochemicals in Stress Tolerance of Crops: A Review",
      "Journal": "Plants",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/plants11081133",
      "Impact Factor": 3.935
    },
    {
      "S.No": 125,
      "Authors": "Mahak Majeed, Tanveer Bilal Pirzadah, Manzoor Ahmad Mir, Khalid Rehman Hakeem*",
      "Title": "Diversity and Bioactive Properties of Herbal Plants Used in Traditional Medicine: An Overview",
      "Journal": "Plants",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/plants11050793",
      "Impact Factor": 3.935
    },
    {
      "S.No": 124,
      "Authors": "Saeed Shafique, Khalid Rehman Hakeem, Abdur Rehman and Hesham F. Alharby",
      "Title": "Bacterial Bioinformatics for Marine Environment Research",
      "Journal": "Marine Drugs",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/md20110726",
      "Impact Factor": 5.493
    },
    {
      "S.No": 123,
      "Authors": "Syed A. Hussain, Khalid Rehman Hakeem, Manzoor Ahmad Mir and Jamil H. Awan",
      "Title": "Evaluation of Mineral and Heavy Metal Contaminants in the Vegetables Grown in Treated Sewage Water Irrigated Soils",
      "Journal": "Toxics",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/toxics10010011",
      "Impact Factor": 3.932
    },
    {
      "S.No": 122,
      "Authors": "Aneesa Saleem, Khalid Rehman Hakeem, Ibrar Ahmad and Hesham F. Alharby",
      "Title": "Bioactive Properties of Plants: Importance and Applications",
      "Journal": "Antioxidants",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/antiox11020296",
      "Impact Factor": 6.444
    },
    {
      "S.No": 121,
      "Authors": "Naseem Akhtar, Khalid Rehman Hakeem and Afifa Arif",
      "Title": "Impact of Heavy Metals on Soil and Vegetation: A Review",
      "Journal": "Sustainability",
      "Year": 2022,
      "DOI": "https://doi.org/10.3390/su14030818",
      "Impact Factor": 3.251
    }
  ],
  "2023": [
    {
      "S.No": 120,
      "Authors": "Alaa Abdul Aziz, Khalid Rehman Hakeem*, Samir A. Jilani and Asma F. Al-Turki",
      "Title": "Acacia mearnsii as a Promising Species for Bioremediation of Heavy Metal Contaminated Soil: A Review",
      "Journal": "Toxics",
      "Year": 2023,
      "DOI": "https://doi.org/10.3390/toxics11010009",
      "Impact Factor": 3.932
    },
    {
      "S.No": 119,
      "Authors": "Tanzeela Kokab, Khalid Rehman Hakeem*, Qaisar Khan, Faizan Malik, Muhammad N. Bashir and Muhammad W. N. Bashir",
      "Title": "Potential Impacts of Heavy Metals on Soil Quality and Food Safety: A Review",
      "Journal": "International Journal of Environmental Research and Public Health",
      "Year": 2023,
      "DOI": "https://doi.org/10.3390/ijerph20010066",
      "Impact Factor": 3.390
    },
    {
      "S.No": 118,
      "Authors": "Khalid Rehman Hakeem*, Foziah Shah, Abdul Latif, Hameed Alsamadany and Zainab Alqahtani",
      "Title": "Use of Plant Secondary Metabolites for the Remediation of Heavy Metal Contaminated Soil",
      "Journal": "Antioxidants",
      "Year": 2023,
      "DOI": "https://doi.org/10.3390/antiox12040809",
      "Impact Factor": 6.444
    },
    {
      "S.No": 117,
      "Authors": "Muhammad W. N. Bashir, Khalid Rehman Hakeem*, Ashraf Asif, Asif M. Sheikh, Waqas M. Khan and Taimoor Ahmed",
      "Title": "Biochemical and Molecular Mechanisms of the Mycorrhizal Fungi in Enhancing the Tolerance of Plants against Heavy Metals",
      "Journal": "Microorganisms",
      "Year": 2023,
      "DOI": "https://doi.org/10.3390/microorganisms11040957",
      "Impact Factor": 4.584
    },
    {
      "S.No": 116,
      "Authors": "Mahak Majeed, Khalid Rehman Hakeem and Reiaz Ul Rehman",
      "Title": "Mistletoe Lectins: From interconnecting proteins to potential tumour inhibiting agents",
      "Journal": "Phytomedicine Plus",
      "Year": 2021,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S266703132100021X",
      "Impact Factor": null
    },
    {
      "S.No": 115,
      "Authors": "J. A. Lone, F. A. Lone, K. Toppo, K. R. Hakeem and S. A. Dar",
      "Title": "Potential of Fresh Water Green Microalgae Scenedesmus dimorphus in Producing High Quality Biodiesel",
      "Journal": "Science Letters",
      "Year": 2021,
      "DOI": "https://www.scienceletters.org/general-issue-and-current-issue ",
      "Impact Factor": null
    }
  ],
"2020": [
    {
      "S.No": 114,
      "Authors": "Zeenat Mushtaq, Shahla Faizan, Basit Gulzar and Khalid Rehman Hakeem",
      "Title": "Inoculation of Rhizobium alleviates salinity stress through modulation of growth characteristics, physiological and biochemical attributes, stomatal activities and antioxidant defense in Cicer arietinum L.",
      "Journal": "Journal of Plant Growth Regulation",
      "Year": 2020,
      "DOI": "https://link.springer.com/article/10.1007/s00344-020-10267-1",
      "Impact Factor": 4.169
    },
    {
      "S.No": 113,
      "Authors": "Waseem Mushtaq, Quratul Ain, M.B. Siddiqui, Hesham F. Alharby and Khalid Rehman Hakeem",
      "Title": "Interspecific inhibitory interference of Nicotiana plumbaginifolia Viv. on Pisum sativum L.",
      "Journal": "Journal of Plant Growth Regulation",
      "Year": 2020,
      "DOI": "https://link.springer.com/article/10.1007/s00344-020-10247-5",
      "Impact Factor": 4.169
    },
    {
      "S.No": 112,
      "Authors": "Elsayed S. Abdel Razik, Basmah M. Alharbi, Tanveer Bilal Pirzadah, Ghalia S. H. Alnusairi, Mona H. Soliman and Khalid Rehman Hakeem",
      "Title": "γ-aminobutyric acid mitigates drought & heat stress in Helianthus annuus L.by regulating its physiological, biochemical & molecular pathways",
      "Journal": "Physiologia Plantarum",
      "Year": 2020,
      "DOI": "https://doi.org/10.1111/ppl.13216",
      "Impact Factor": 4.500
    },
    {
      "S.No": 111,
      "Authors": "Muzammil Shah, Hesham F. Alharby, Khalid Rehman Hakeem, Niaz Ali, Inayat Ur Rahman, Muhammed Munawar, Yasir Anwar",
      "Title": "RNA-Sequencing and de novo assembly of Lantana camara leaf Transcriptome for the identification of genes involved in phenylpropanoid biosynthesis pathway",
      "Journal": "Scientific Reports",
      "Year": 2020,
      "DOI": "https://www.nature.com/articles/s41598-020-70635-5",
      "Impact Factor": 4.379
    },
    {
      "S.No": 110,
      "Authors": "Huseyin Tombuloglu, Yassine Slimani, Thamer Marhoon AlShammari, Muhammed Bargouti, Mehmet Ozdemir, Guzin Tombuloglu, Sultan Akhtar, Hussain Sabit, Khalid Rehman Hakeem, Munirah Almessiere, Ismail Ercan, Abdulhadi Baykalh",
      "Title": "Uptake, translocation, and physiological effects of hematite (α-Fe2O3) nanoparticles in barley (Hordeum vulgare L.)",
      "Journal": "Environmental Pollution",
      "Year": 2020,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0269749120360796",
      "Impact Factor": 8.071
    },
    {
      "S.No": 109,
      "Authors": "Waqas Amir, Hafiz K Ishaq, Sheharyaar Farid, Muhammad Zubair, Hesham F Alharby, Atif A Bamagoos, Muhammad Rizwan, Nighat Raza, Khalid R Hakeem, Shafaqat Ali",
      "Title": "Accumulation potential and tolerance response of Typha latifolia L. under citric acid assisted phytoextraction of lead and mercury",
      "Journal": "Chemosphere",
      "Year": 2020,
      "DOI": "https://www.sciencedirect.com/science/article/abs/pii/S0045653520314405",
      "Impact Factor": 7.086
    },
    {
      "S.No": 108,
      "Authors": "Muhammad Hamzah Saleem, Shafaqat Ali, Muzammal Rehman, Muhammad Rizwan, Muhammad Kamran, Ibrahim A.A. Mohamed, Zaid Khan, Hesham F. Alharby, Khalid Rehman Hakeem, Lijun Liu",
      "Title": "Individual and combined application of EDTA and citric acid assisted phytoextraction of copper using jute (Corchorus capsularis L.) seedlings",
      "Journal": "Environmental Technology and Innovation",
      "Year": 2020,
      "DOI": "https://www.sciencedirect.com/science/article/abs/pii/S2352186420300274",
      "Impact Factor": 5.263
    },
    {
      "S.No": 107,
      "Authors": "Robert Muscarella, Khalid Rehman Hakeem et al.",
      "Title": "Global Variation Of Tree Palm Abundance",
      "Journal": "Global Ecology and Biogeography",
      "Year": 2020,
      "DOI": "https://onlinelibrary.wiley.com/doi/full/10.1111/geb.13123",
      "Impact Factor": 7.144
    },
    {
      "S.No": 106,
      "Authors": "Ishani Chakrabartty, Naba Kumar Kalita, Pankaj Boruah, Vimal Katiyar, Khalid Rehman Hakeem and Latha Rangan",
      "Title": "Physico - rheological characterization of organically - derived seed samples from Alpinia nigra, an ethnic medicinal plant of North-East India",
      "Journal": "Industrial Crops and Products",
      "Year": 2020,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0926669020304763?dgcid=coauthor",
      "Impact Factor": 5.645
    },
    {
      "S.No": 105,
      "Authors": "Tanveer Bilal Pirzadah, Bisma Malik, Inayatullah Tahir, Khalid Rehman Hakeem, Reiaz Ul Rehman",
      "Title": "Lead Toxicity Alters the activities of Antioxidant enzymes and Modulate the Biomarkers in Tartary Buckwheat Plants",
      "Journal": "International Biodeteriotation and Biodegradation",
      "Year": 2020,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0964830520302110",
      "Impact Factor": 4.320
    },
    {
      "S.No": 104,
      "Authors": "Ghulam Khaliq, Atraf Saleh, Ghulam Ali Bugti, Khalid Rehman Hakeem",
      "Title": "Guggul gum incorporated with basil essential oil improves quality and modulates cell wall degrading enzymes of jamun fruit during storage",
      "Journal": "Scientia Horticultarea",
      "Year": 2020,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0304423820304362",
      "Impact Factor": 3.463
    },
    {
      "S.No": 103,
      "Authors": "Waseem Mushtaq, Quratul ain, M.B. Siddiqui and Khalid Rehman Hakeem",
      "Title": "Allelochemicals change macromolecular of some selected weeds",
      "Journal": "South African Journal of Botany",
      "Year": 2020,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S025462991930064X",
      "Impact Factor": 2.315
    },
    {
      "S.No": 102,
      "Authors": "Anshula Sharma, Gaganjot Gupta, Tawseef Ahmad, Baljinder Kaur and Khalid Rehman Hakeem",
      "Title": "Tailoring Cellular Metabolism in Lactic Acid Bacteria through Metabolic Engineering",
      "Journal": "Journal of Microbiological methods",
      "Year": 2020,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0167701219307717",
      "Impact Factor": 2.363
    },
    {
      "S.No": 101,
      "Authors": "Waseem Mushtaq, M.B. Siddiqui and K.R. Hakeem",
      "Title": "Assessment of contribution of foliar trichomes towards allelopathy",
      "Journal": "Phyton, International Journal of Experimental Botany",
      "Year": 2020,
      "DOI": "http://www.techscience.com/phyton/v89n2/38673",
      "Impact Factor": 1.038
    },
    {
      "S.No": 100,
      "Authors": "Rakan H. Yousef, Othman A.S.Baothman, Wesam H. Abdulaal, Mohamed K. Abo-Golayel, Anass Darwish, Said S. Moselhy, youssri Ahmed and Khalid Rehman Hakeem",
      "Title": "Potential antitumor activity of exopolysaccharide produced from date seed powder as carbon source for Bacillus subtilis",
      "Journal": "Journal of Microbiological methods",
      "Year": 2020,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0167701219302854",
      "Impact Factor": 2.363
    },
    {
      "S.No": 99,
      "Authors": "Hesham F Alharby, Hameed Alsamadany, Khalid Rehman Hakeem and Yahya M Alzahrani",
      "Title": "Impact of Drought and Calcium Sulfate on Antioxidants, S-assimilation, Ecophysiology and Growth of Tomato (Lycopersicon esculentum)",
      "Journal": "International Journal of Agriculture and Biology",
      "Year": 2020,
      "DOI": "https://www.fspublishers.org/Issue.php?y=2020&v_no=23&categoryID=901",
      "Impact Factor": 0.822
    },
    {
      "S.No": 98,
      "Authors": "Eisa Odah Aid Alblwi, Othman A.S.Baothman, Wesam H. Abdulaal, Mohamed K. Abo-Golayel, Youssri M Ahmed and Khalid Rehman Hakeem",
      "Title": "Production, Purification, Characterization and biological activity of Prodigiosin Produced from Serratia marcescens",
      "Journal": "Tropical Journal of Pharmaceutical Research",
      "Year": 2020,
      "DOI": "",
      "Impact Factor": 0.504
    },
    {
      "S.No": 97,
      "Authors": "Steve Harakeh, Wafaa S. Ramadan, Mohammed S. Al Muhayawi, Soad Al Jaouni, Shaker Mousa, Khalid Rehman Hakeem",
      "Title": "Pomegranate peel extract lessens histopathologic changes and restores antioxidant homeostasis in the hippocampus of rats with aluminium chloride-induced Alzheimer’s disease",
      "Journal": "Asia Pacific Journal of Tropical medicine",
      "Year": 2020,
      "DOI": "http://www.apjtm.org/article.asp?issn=1995-7645;year=2020;volume=13;issue=10;spage=456;epage=463;aulast=Harakeh",
      "Impact Factor": 1.226
    },
    {
      "S.No": 96,
      "Authors": "Md Mahadi Hasan, AbdulRehman Hajar, Hesham F. Alharby, Khalid Rehman Hakeem",
      "Title": "Magnetized water confers drought stress tolerance in Moringa biotype via modulation of growth, gas exchange, lipid peroxidation and antioxidant activity",
      "Journal": "Polish Journal of Environmental Studies",
      "Year": 2020,
      "DOI": "http://www.pjoes.com/Magnetized-Water-Confers-Drought-Stress-nTolerance-in-Moringa-Biotype-via-Modulation,110347,0,2.html",
      "Impact Factor": 1.699
    },
    {
      "S.No": 95,
      "Authors": "Muzammil Shah, Hesham Alharby, Khalid Rehman Hakeem, Munawwar Shah",
      "Title": "Identification of SSRs and SNPs in the leaf and root transcriptome of Lantana camera",
      "Journal": "Bioscience Research",
      "Year": 2020,
      "DOI": "https://www.isisn.org/BR17(2)2020/753-758-17(2)2020BR20-130.pdf",
      "Impact Factor": 0.737
    },
    {
      "S.No": 94,
      "Authors": "Eijaz Ahmed Bhat, Nasreena Sajjad, Jamal S.M. Sabir, Majid Rasool Kamli, Khalid Rehman Hakeem, Irfan A. Rather, Ahmed Bahieldin",
      "Title": "Molecular cloning, expression, overproduction and characterization of Human TRAIP Leucine zipper protein",
      "Journal": "Saudi Journal of Biological Sciences",
      "Year": 2020,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S1319562X20300875",
      "Impact Factor": 4.219
    },
    {
      "S.No": 93,
      "Authors": "Yahya Alzahrani, Hesham F. Alharby, Khalid Rehman Hakeem, Hameed Alsamadany",
      "Title": "Modulating effect of Ethylene diamine tetra acetic acid (EDTA) and Sodium dodecyl sulphate (SDS) on growth, biochemical parameters and antioxidant defense system of Dahlia variabilis Cav. grown under cadmium and lead induced stress",
      "Journal": "Notulae Botanicae Horti Agrobotanici Cluj-Napoca",
      "Year": 2020,
      "DOI": "https://www.notulaebotanicae.ro/index.php/nbha/article/view/11909",
      "Impact Factor": 1.444
    },
    {
      "S.No": 92,
      "Authors": "Adnan Shakeel, Abrar Ahmad Khan & Khalid Rehman Hakeem",
      "Title": "Growth, biochemical, and antioxidant response of beetroot (Beta vulgaris L.) grown in fly ash-amended soil",
      "Journal": "SN Applied Science",
      "Year": 2020,
      "DOI": "https://doi.org/10.1007/s42452-020-3191-4",
      "Impact Factor": 0
    },
    {
      "S.No": 91,
      "Authors": "Abeer M. Kutby, Hassan S. Al-Zahrani and Khalid R. Hakeem",
      "Title": "Role of Magnetic Field and Brassinosteroids in Mitigating Salinity Stress in Tomato (Lycopersicon Esculentum L.)",
      "Journal": "International Journal of Engineering Research & Technology",
      "Year": 2020,
      "DOI": "https://www.ijert.org/role-of-magnetic-field-and-brassinosteroids-in-mitigating-salinity-stress-in-tomato-lycopersicon-esculentum-l",
      "Impact Factor": 0
    },
    {
      "S.No": 90,
      "Authors": "Muzammil Shah, Hesham F. Alharby, Khalid Rehman Hakeem",
      "Title": "Lantana camara: A Comprehensive Review on Phytochemistry, Ethnopharmacology and Essential Oil Composition",
      "Journal": "Letters in Applied NanoBioScience",
      "Year": 2020,
      "DOI": "https://nanobioletters.com/all-issues/2020-2/issue-3",
      "Impact Factor": 0
    }
  ],
  "2019": [
    {
      "S.No": 89,
      "Authors": "Khalid Rehman Hakeem*, Hesham F. Alharby and Reiaz Ul Rehman",
      "Title": "Antioxidative defense mechanism against lead-induced phytotoxicity in Fagopyrum kashmirianum",
      "Journal": "Chemosphere",
      "Year": 2019,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0045653518319921",
      "Impact Factor": 7.086
    },
    {
      "S.No": 88,
      "Authors": "Tanveer Bilal Pirzadah, Bisma Malik, Inayatullah Tahir, Reiaz Ul Rehman, Khalid Rehman Hakeem and Hesham F. Alharby",
      "Title": "Aluminium stress modulates the osmolytes and enzyme defense system in Fagopyrum species",
      "Journal": "Plant Physiology and Biochemistry",
      "Year": 2019,
      "DOI": "https://www.sciencedirect.com/science/article/abs/pii/S0981942819303778",
      "Impact Factor": 3.372
    },
    {
      "S.No": 87,
      "Authors": "Mona Soliman, Haifa A. Alhaithloul, Khalid Rehman Hakeem, Amr Elkelish",
      "Title": "Exogenous Nitric oxide mitigates Nickel induced oxidative damage in Eggplant by up-regulating antioxidant, osmolyte metabolism and glyoxalase system",
      "Journal": "Plants",
      "Year": 2019,
      "DOI": "https://doi.org/10.3390/plants8120562",
      "Impact Factor": 3.935
    },
    {
      "S.No": 86,
      "Authors": "Huseyin Tombuloglu, Yassine Slimani, Guzin Tombuloglu, Munirah Almessiere, Huseyin Sozeri, Ayse Demir-Korkmaz, Thamer Marhoon AlShammari, Abdulhadi Baykal, Ismail Ercan, Khalid Rehman Hakeem",
      "Title": "Impact of calcium and magnesium substituted strontium nano-hexaferrite on mineral uptake, magnetic character and physiology of barley (Hordeum vulgare L.)",
      "Journal": "Ecotoxicology and Environmental Safety",
      "Year": 2019,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0147651319310826?dgcid=coauthor",
      "Impact Factor": 4.872
    },
    {
      "S.No": 85,
      "Authors": "Waseem Mushtaq, Quratul Ain, M.B. Siddiqui, Khalid Rehman Hakeem*",
      "Title": "Cytotoxic allelochemicals induce ultrastructural modifications in Cassia tora L. and mitosis changes in Allium cepa L.: A weed versus weed allelopathy approach",
      "Journal": "Protoplasma",
      "Year": 2019,
      "DOI": "https://doi.org/10.1007/s00709-018-01343-1",
      "Impact Factor": 2.751
    },
    {
      "S.No": 84,
      "Authors": "Faridah-Hanum, Fatimah M. Yusoff, A. Fitrianto, Nuruddin A. Ainuddin, Seca Gandaseca, S. Zaiton, K. Norizah, S. Nurhidayu, M.K. Roslan, Khalid R. Hakeem, I. Shamsuddin, Ismail Adnan, A.G. Awang Noor, A.R.S. Balqis, P.P. Rhyma, I. Siti Aminah, F. Hilaluddin, R. Fatin, N.Z.N. Harun",
      "Title": "Development of a comprehensive Mangrove Quality Index (MQI) in Matang Mangrove: assessing mangrove ecosystem health",
      "Journal": "Ecological Indicator",
      "Year": 2019,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S1470160X19301396",
      "Impact Factor": 4.229
    },
    {
      "S.No": 83,
      "Authors": "Shah Fahad, Faheem Ahmed Khan, Nuruliarizki Shinta Pandupuspitasari, Saddam Hussain, Imtiaz Ali Khan, Muhammad Saeed, Shah Saud, Shah Hassan, Muhammad Adnan, Amanullah, Muhammad Arif, Mukhtar Alam, Hidayat Ullah, Khalid Rehman Hakeem, Hesham Alharby, Muhammad Riaz, Muhammad Sameeullah, Hafiz Mohkum Hammad, Wajid Nasim, Shakeel Ahmad, Muhammad Afzal, Salem Safer Alghamdi, Atif A. Bamagoos, Elsayed Fathi Abd_Allah, Jianliang Huang",
      "Title": "Suppressing photorespiration for the improvement in photosynthesis and crop yields: A review on the role of S-allantoin as a nitrogen source",
      "Journal": "Journal of Environmental Management",
      "Year": 2019,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0301479719302336?via%3Dihub",
      "Impact Factor": 5.647
    },
    {
      "S.No": 82,
      "Authors": "Hesham F. Alharby, Hassan S. Al-Zahrani, Khalid Rehman Hakeem*, Muhammad Iqbal",
      "Title": "Identification of Physiological and Biochemical Markers for Salt (NaCl) Stress in the Seedlings of Mungbean [Vigna radiata (L.) Wilczek] Genotypes",
      "Journal": "Saudi Journal of Biological Sciences",
      "Year": 2019,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S1319562X18301815#!",
      "Impact Factor": 2.802
    },
    {
      "S.No": 81,
      "Authors": "Md. Mahadi Hasan, Md. Nashir Uddin, Iffat Ara-Sharmeen, Hesham F. Alharby, Yahya Alzahrani, Khalid Rehman Hakeem and Li Zhang",
      "Title": "Assisting Phytoremediation of Heavy Metals Using Chemical Amendments",
      "Journal": "Plants",
      "Year": 2019,
      "DOI": "https://doi.org/10.3390/plants8090295",
      "Impact Factor": 3.935
    },
    {
      "S.No": 80,
      "Authors": "Mehtap Aydin, Guzin Tombuloglu, Mehmet Serdal Sakcali, Huseyin Tombuloglu and Khalid Rehman Hakeem",
      "Title": "Boron Alleviates Drought Stress by Enhancing Gene Expression and Antioxidant Enzyme Activity",
      "Journal": "Journal of Soil Science and Plant Nutrition",
      "Year": 2019,
      "DOI": "https://link.springer.com/article/10.1007/s42729-019-00053-8",
      "Impact Factor": 2.156
    },
    {
      "S.No": 79,
      "Authors": "Ismail Abiola Adebayo, Haladu Ali Gagman, Wasiu Gbolahan Balogun, Mowaffaq Adam Ahmed Adam, Rafedah Abas, Khalid Rehman Hakeem, Nik Ahmad Irwan Izzauddin Bin Nik Him, Muhammad Razip Bin Samian, Hasni Arsad",
      "Title": "Detarium microcarpum, Guiera senegalensis, and Cassia siamea Induce Apoptosis and Cell Cycle Arrest and Inhibit Metastasis on MCF7 Breast Cancer Cells",
      "Journal": "Evidence-Based Complementary and Alternative Medicine",
      "Year": 2019,
      "DOI": "https://doi.org/10.1155/2019/1529570",
      "Impact Factor": 1.813
    },
    {
      "S.No": 78,
      "Authors": "Sheikh Altaf Hussain, Naseem Ahmad, Mohammad Anis, Khalid Rehman Hakeem*",
      "Title": "Development of an efficient micropropagation system for Tecoma stans (L.) Juss. ex Kunth using thidiazuron and effects on phytochemical constitution",
      "Journal": "In Vitro Cellular & Developmental Biology – Plant",
      "Year": 2019,
      "DOI": "https://link.springer.com/article/10.1007/s11627-019-10001-x",
      "Impact Factor": 1.814
    },
    {
      "S.No": 77,
      "Authors": "Md Mahadi Hasan, AbdulRehman Hajar, Hesham F. Alharby, Khalid Rehman Hakeem*",
      "Title": "The effect of magnetized water on the growth and physiological conditions of the Moringa species under drought stress",
      "Journal": "Polish Journal of Environmental Sciences",
      "Year": 2019,
      "DOI": "http://www.pjoes.com/The-Effect-of-Magnetized-Water-on-the-Growth-nand-Physiological-Conditions-of-Moringa,85879,0,2.html",
      "Impact Factor": 1.383
    },
    {
      "S.No": 76,
      "Authors": "Tanveer Bilal, Bisma Malik, Khalid Rehman Hakeem*",
      "Title": "Metagenomic analysis of uncultured microorganisms and their enzymatic attributes",
      "Journal": "Journal of Microbiological Methods",
      "Year": 2019,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0167701218308741",
      "Impact Factor": 1.707
    },
    {
      "S.No": 75,
      "Authors": "Waseem Mushtaq, Adnan Shakeel, Mohammad Mehdizadeh, Sameera A. Alghamdi and Khalid Rehman Hakeem",
      "Title": "Impact of plant invasions on local vegetation: an Indian perspective",
      "Journal": "BioSci Biotech Res Asia",
      "Year": 2019,
      "DOI": "https://bit.ly/35FnhNw",
      "Impact Factor": null
    },
    {
      "S.No": 74,
      "Authors": "Hesham F. Alharby, Hassan S. Al-Zahrani, Khalid Rehman Hakeem*, Reiaz Ul Rehman and Muhammad Iqbal",
      "Title": "Salinity-Induced Antioxidant Enzyme System In Mungbean [Vigna Radiata (L.) Wilczek] Cv.) Genotypes",
      "Journal": "Pakistan Journal of Botany",
      "Year": 2019,
      "DOI": "http://www.pakbs.org/pjbot/papers/1555927066.pdf",
      "Impact Factor": 0.800
    },
    {
      "S.No": 73,
      "Authors": "Anas A Darwish, Omar A. M. Al-Bar, Rakan H Yousef, Said S Moselhy, Youssri M Ahmed, Khalid Rehman Hakeem*",
      "Title": "Production of Antioxidant Exopolysaccharide from Pseudomonas aeruginosa Utilizing Heavy Oil as a Solo Carbon Source",
      "Journal": "Pharmacognosy Research",
      "Year": 2019,
      "DOI": "http://www.phcogres.com/article.asp?issn=0974-8490;year=2019;volume=11;issue=4;spage=378;epage=383;aulast=Darwish",
      "Impact Factor": null
    },
    {
      "S.No": 72,
      "Authors": "Faridah-Hanum, Fatimah M. Yusoff, A. Fitrianto, Nuruddin A. Ainuddin, Seca Gandaseca, S. Zaiton, K. Norizah, S. Nurhidayu, M.K. Roslan, Khalid R. Hakeem, I. Shamsuddin, Ismail Adnan, A.G. Awang Noor, A.R.S. Balqis, P.P. Rhyma, I. Siti Aminah, F. Hilaluddin, R. Fatin, N.Z.N. Harun",
      "Title": "How to develop a comprehensive Mangrove Quality Index?",
      "Journal": "MethodsX",
      "Year": 2019,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S2215016119301712",
      "Impact Factor": null
    },
    {
      "S.No": 71,
      "Authors": "Muhammad Sabir, Yasir Anwar, Akram Khan, Muhammad Ali, Peerzada Yasir Yousuf, Khalid Al-Ghamdi and Khalid Rehman Hakeem*",
      "Title": "ChiC Gene Enhances Fungal Resistance in Indigenous Potato Variety (Diamant) Via Agrobacterium-Mediated Transformation",
      "Journal": "BioSci Biotech Res Asia",
      "Year": 2019,
      "DOI": "http://www.biotech-asia.org/vol16no2/chic-gene-enhances-fungal-resistance-in-indigenous-potato-variety-diamant-via-agrobacterium-mediated-transformation/",
      "Impact Factor": null
    },
    {
      "S.No": 70,
      "Authors": "Seyed Mousa Sadeghi, I. Faridah-Hanum, Kamziah Abd Kudus and Khalid Rehman Hakeem",
      "Title": "Recovery Of Tree Species Composition, Diversity And Biomass Of A Hill Dipterocarp Forest After Logging",
      "Journal": "Malayan Nature Journal",
      "Year": 2019,
      "DOI": null,
      "Impact Factor": null
    }
],
"2018": [
    {
      "S.No": 69,
      "Authors": "Ferry Slik, Víctor Arroyo-Rodríguez, Richard Field, Salomon Aguilar, Nikolay Aguirre, Jorge Ahumad, Shin-Ichiro Aiba, Luciana F. Alves, Anitha K, Andres Avella, Francisco Mora Ardila, Gerardo A. Aymard C., Selene Báez, Patricia Balvanera, Meredith L. Bastian, Jean-François Bastin, Peter J. Bellingham, Eduardo van den Berg, Polyanna da Conceição Bispo, Pascal Boeckx, Katrin Boehning-Gaese, Frans Bongers, Brad Boyle, Fabian Brambach, Francis Q. Brearley, Sandra Brown, Shauna-Lee Chai, Robin Chazdon, Shengbin Chen, Phourin Chhang, George Chuyong, Ewango Corneille, Indiana M. Coronado, Jurgi Cristóbal-Azkarate, Heike Culmsee, Kipiro Damas, HS Dattaraja, Priya Davidar, Saara DeWalt, Hazimah Din, Donald R. Drake, Alvaro Duque, Giselda Durigan, Karl Eichhorn, Eduardo Schmidt Eler, Tsutomu Enoki, Andreas Ensslin, Adandé Belarmain Fandohan, Nina Farwig, Kenneth J. Feeley, Markus Fischer, Olle Forshed, Janet Franklin, Queila Garcia, Satish Chandra Garkoti, Thomas Gillespie, Jean-Francois Gillet, Christelle Gonmadje, Iñigo Granzow-de la Cerda, Daniel Griffith, James Grogan, Khalid Rehman Hakeem, David Harris, Rhett Harrison, Andy Hector, Andreas Hemp, Jürgen Homeier, M. Shah Hussain, Guillermo Ibarra-Manríquez, Faridah Hanum Ibrahim, Nobuo Imai, Patrick A. Jansen, Shijo Joseph, Kuswata Kartawinata, Elizabeth Kearsley, Daniel Kelly, Michael Kessler, Timothy J. Killeen, Robert Kooyman, Yves Laumonier, Susan Laurance, William Laurance, Michael Lawes, Susan Letcher, Jeremy Lindsell, Jon Lovett, Jose Lozada, Xinghui Lu, Anne Mette Lykke, Khairil Bin Mahmud, Ni Putu Diana Mahayani, Asyra Mansor, Andrew R. Marshall, Emanuel H. Martin, Darley Calderado Leal Matos, Jorge A. Meave, Felipe P. L. Melo, Zhofre Huberto Aguirre Mendoza, Faizah Metali, Vincent Metjibe, Jean Paul Metzger, Thiago Metzker, D. Mohandass, Miguel A. Munguía-Rosas, Rodrigo Muñoz, Eddy Nurtjahya, Eddie Lenza de Oliveira, Onrizal, Pia Parolin, Marc Parren, N Parthasarathy, Ekananda Paudel, Rolando Perez, Eduardo A. Perez-Garcia, Ulf Pommer, Lourens Poorter, Lan Qie, Maria Teresa F. Piedade, José Roberto Rodrigues Pinto, Axel Dalberg Poulsen, John Poulse, Jennifer S. Powers, Rama Chandra Prasad, Jean-Philippe Puyravaud, Orlando Rangel, Jan Reitsma, Diogo S. B. Rocha, Samir Rolim, Francesco Rovero, Andes Rozak, Kalle Ruokolainen, Ervan Rutishauser, Gemma Rutten, Mohd. Nizam Mohd. Said, Felipe Z. Saiter, Philippe Saner, Braulio Santos, João Roberto dos Santos, Swapan Kumar Sarker, Christine B. Schmitt, Jochen Schoegart, Mark Schulze, Douglas Sheil, Alexandre F. Souza, Wilson Roberto Spironello, Tereza Sposito, Robert Steinmetz, Tariq Stevart, Marcio Seiji Suganuma, Rahayu Sukri, Aisha Sultana, Raman Sukumar, Terry Sunderland, Supriyadi, Suresh H. S., Eizi Suzuki, Marcelo Tabarelli, Jianwei Tang, Ed V. J. Tanner, Natalia Targhetta, Ida Theilade, Duncan Thomas, Jonathan Timberlake, Márcio de Morisson Valeriano, Johan van Valkenburg, Tran Van Do, Sam Van Hoang, John H. Vandermeer, Hans Verbeeck, Ole Reidar Vetaas, Adekunle Victor, Simone A. Vieira, Campbell Webb, Edward Webb, Tim Whitfeld, Serge Wich, John Williams, Susan Wiser, Florian Wittmann, Xiaobo Yang, C. Yves Adou Yao, Sandra Yap, Rakan A. Zahawi, Rahmad Zakaria, Runguo Zang.",
      "Title": "A Phylogenetic Classification Of The World’s Tropical Forests.",
      "Journal": "Proceedings of National Academy of Sciences (PNAS), USA.",
      "Year": 2018,
      "DOI": "https://www.pnas.org/content/115/8/1837",
      "Impact Factor": 11.205
    },
    {
      "S.No": 68,
      "Authors": "Furkhan Ahmed Mohammed, Ayman I. Elkady, Fareeduddin Quadri Syed, Muqtadir Baig Mirza, Khalid Rehman Hakeem, Saleh Alkarim.",
      "Title": "Anethum graveolens (dill) - A Medicinal Herb Induces Apoptosis and Cell Cycle Arrest in Human Hepatocellular Carcinoma (HepG2).",
      "Journal": "Journal of Ethnopharmacology",
      "Year": 2018,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0378874118305750?via%3Dihub",
      "Impact Factor": 4.360
    },
    {
      "S.No": 67,
      "Authors": "Muqtadir Baig Mirza, Ayman I. Elkady, Atef M. Al-Attar, Fareeduddin Quadri Syed, Furkhan Ahmed Mohammed, Khalid Rehman Hakeem.",
      "Title": "Induction of apoptosis and cell cycle arrest by ethyl acetate fraction of Phoenix dactylifera L. (Ajwa dates) in prostate cancer cells.",
      "Journal": "Journal of Ethnopharmacology",
      "Year": 2018,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0378874117342952?via%3Dihub",
      "Impact Factor": 4.360
    },
    {
      "S.No": 66,
      "Authors": "Fareeduddin Quadri Syed, Ayman I. Elkady, Furkhan Ahmed Mohammed, Muqtadir Baig Mirza, Khalid Rehman Hakeem, Saleh Alkarim.",
      "Title": "Chloroform fraction of Foeniculum vulgare induced ROS mediated, mitochondria-caspase-dependent apoptotic pathway in MCF-7, human breast cancer cell line.",
      "Journal": "Journal of Ethnopharmacology",
      "Year": 2018,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0378874117346123",
      "Impact Factor": 4.360
    },
    {
      "S.No": 65,
      "Authors": "Rabbia Murtaza, Muhammad Fahim Khokhar, Naila Zeb, Asma Noreen, Khalid Rehman Hakeem.",
      "Title": "Multi-Sensor Temporal Assessment of Tropospheric Nitrogen Dioxide Column Densities over Pakistan.",
      "Journal": "Environmental Science and Pollution Research",
      "Year": 2018,
      "DOI": "https://link.springer.com/article/10.1007/s11356-017-1176-7",
      "Impact Factor": 4.223
    },
    {
      "S.No": 64,
      "Authors": "Asma Noreen, Muhammad Fahim Khokhar, Naila Zeb, Naila Yasmin, Khalid Rehman Hakeem.",
      "Title": "Spatio-Temporal Assessment and Seasonal Variation of Tropospheric Ozone Concentrations in Pakistan during the Last Decade.",
      "Journal": "Environmental Science and Pollution Research",
      "Year": 2018,
      "DOI": "https://link.springer.com/article/10.1007/s11356-017-1010-2",
      "Impact Factor": 4.223
    },
    {
      "S.No": 63,
      "Authors": "Md Mahadi Hasan, Hesham F. Alharby, AbdulRehman Hajar, Khalid Rehman Hakeem.",
      "Title": "Effects Of Magnetized Water On Phenolic Compounds, Lipid Peroxidation And Antioxidant Activity Of Moringa Species Under Drought Stress.",
      "Journal": "Journal of Plants and Animals",
      "Year": 2018,
      "DOI": "http://thejaps.org.pk/docs/Accepted/2018/28-3/08.pdf",
      "Impact Factor": 0.529
    },
    {
      "S.No": 62,
      "Authors": "Rouf Ahmad Bhat, Moonisa Aslam Dervash, Mohammad Aneesul Mehmood, Khalid Rehman Hakeem.",
      "Title": "Municipal Solid Waste Generation and its Management, a Growing Threat to Fragile Ecosystem in Kashmir Himalaya.",
      "Journal": "American Journal of Environmental Science",
      "Year": 2018,
      "DOI": "https://thescipub.com/pdf/10.3844/ajessp.2017.388.397"
    },
    {
      "S.No": 61,
      "Authors": "Hina Mushtaq, S.A.Shameem, Mumtaz Mohd Bhat, Abdul Hai, Khalid Rehman Hakeem.",
      "Title": "Pollution Potential Assessment of Nymphaea alba in Nigeen Basin of Dal Lake, Kashmir (J&K), India.",
      "Journal": "American Journal of Environmental Science",
      "Year": 2018,
      "DOI": "https://thescipub.com/abstract/10.3844/ajessp.2018.44.54"
    },
    {
      "S.No": 60,
      "Authors": "Md. Mahadi Hasan, Md. Arfan Ali, Md. Mahamud Kali Rubel, Muzammil Shah, Yahya Alzahrani, Khalid Rehman Hakeem.",
      "Title": "Influences of Vermicompost and Organic Mulching on Growth, Yield and Profitability of Carrot (Daucus Carota L.).",
      "Journal": "Journal Of Agriculture Biotechnology",
      "Year": 2018,
      "DOI": "http://lawarencepress.com/ojs/index.php/JAB/article/view/539"
    },
    {
      "S.No": 59,
      "Authors": "Sagvan Mohamme H, Shamsudin Ibrahim, Khalid Rehman Hakeem, Kamziah Bt Abd Kudus.",
      "Title": "Development of Volume Function for Final Felling of Pinus brutia Ten in Kurdistan Iraq.",
      "Journal": "Environmental Analysis and Ecology Studies",
      "Year": 2018,
      "DOI": "https://crimsonpublishers.com/eaes/pdf/EAES.000554.pdf"
    }
],
"2017": [
    {
      "S.No": 58,
      "Authors": "Ozturk, M., N. Saba, Altay, V., Rizwan, I., Hakeem, K.R., Jawaid, M., Faridah Hanum, I.",
      "Title": "A Comparative Study on the Biomass and Bioenergy Production in Turkey and Malaysia.",
      "Journal": "Renewable & Sustainable Energy Reviews",
      "Year": 2017,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S1364032117307323",
      "Impact Factor": 14.982
    },
    {
      "S.No": 57,
      "Authors": "Huseyin Tombuloglu, Guzin Tombuloglu, Serdal Sakcali, Ali Turkan, Khalid Rehman Hakeem*, Hesham F. Alharby, Shah Fahd.",
      "Title": "Proteomic analysis of naturally boron-tolerant plant Gypsophila sphaerocephala L. in response to high boron concentration.",
      "Journal": "Journal of Plant Physiology",
      "Year": 2017,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0176161717301724?via%3Dihub",
      "Impact Factor": 3.549
    },
    {
      "S.No": 56,
      "Authors": "Munazza Nisar, Muhammad Fahim Khokhar, Waseem Razzaq Khan, Khalid Rehman Hakeem*.",
      "Title": "Investigating the Nitrogen Dioxide Concentrations near the Surface by Using Multi-axis Spectroscopic Measurements and Validation of Satellite Observations.",
      "Journal": "Environmental Science and Pollution Research",
      "Year": 2017,
      "DOI": "https://link.springer.com/article/10.1007%2Fs11356-016-7907-3",
      "Impact Factor": 4.223
    },
    {
      "S.No": 55,
      "Authors": "Khadija Haider, Muhammad Fahim Khokhar, Farrukh Chishtie, Waseem Razzaq Khan, Khalid Rehman Hakeem*.",
      "Title": "Identification and future description of warming signatures over Pakistan with special emphasis on evolution of CO2 levels and temperature during the first decade of the twenty-first century.",
      "Journal": "Environmental Science and Pollution Research",
      "Year": 2017,
      "DOI": "https://link.springer.com/article/10.1007%2Fs11356-016-8359-5",
      "Impact Factor": 4.223
    },
    {
      "S.No": 54,
      "Authors": "Asad Amin & Wajid Nasim, Muhammad Mubeen, Muhammad Nadeem, Liaqat Ali, Hafiz Mohkum Hammad, Syeda Refat Sultana, Khawar Jabran, M. Habib ur Rehman, Shakeel Ahmad, Muhammad Awais, Atta Rasool, Shah Fahad, Shah Saud, Adnan Noor Shah, Zahid Ihsan, Shahzad Ali, Ali Ahsan Bajwa, Khalid Rehman Hakeem, Asif Ameen, Amanullah, Hafeez Ur Rehman, Fahad Alghabar, Ghulam Hussain Jatoi, Muhammad Akram, Aziz Khan, Faisal Islam, Syed Tahir, Ata-Ul-Karim, Muhammad Ishaq Asif Rehmani, Sajid Hussain, Muhammad Razaq, Amin Fathi.",
      "Title": "Optimizing the phosphorus use in cotton by using CSM-CROPGRO-cotton model for semi-arid climate of Vehari-Punjab, Pakistan.",
      "Journal": "Environmental Science and Pollution Research",
      "Year": 2017,
      "DOI": "https://link.springer.com/article/10.1007/s11356-016-8311-8",
      "Impact Factor": 4.223
    },
    {
      "S.No": 53,
      "Authors": "Chin Kit Ling, Shamsudin Ibrahim, Khalid Rehman Hakeem, Lee Seng Hua, H’ng Paik San.",
      "Title": "Potential Bioenergy Production from Bamboo: Malaysian Perspective.",
      "Journal": "Bioresources",
      "Year": 2017,
      "DOI": "https://ojs.cnr.ncsu.edu/index.php/BioRes/article/view/BioRes_12_3_Review_Chin_Bioenergy_Bamboo_Potential_Malaysia",
      "Impact Factor": 1.396
    },
    {
      "S.No": 52,
      "Authors": "Qurban Pawahar, Umme A Naher, Jusop - Jusop, Othman - Radziah, Khalid Rahman Hakeem, Ismail Mohd Razi, Ariffin Norazrin.",
      "Title": "Aluminum toxicity induced alterations in the leaf proteome of rice contrasting response towards inoculation of plant growth promoting bacteria.",
      "Journal": "Acta Physiologiae Plantarum",
      "Year": 2017,
      "DOI": "https://link.springer.com/article/10.1007/s11738-017-2498-2",
      "Impact Factor": 1.608
    },
    {
      "S.No": 51,
      "Authors": "Iqtidar Hussain, Ejaz Ahmad Khan, Gul Hassan, Jaweria Gul, Hesham F. Alharby, Munir Ozturk, Khalid Rehman Hakeem and Said Alsuthabati.",
      "Title": "Integration of High Seeding Densities and Criss Cross Row Planting Pattern Suppresses Weeds and Increases Grain yield of Spring Wheat (Triticum aestivum L.).",
      "Journal": "Journal of Environmental Biology",
      "Year": 2017,
      "DOI": "http://www.jeb.co.in/index.php?page=issue_toc&issue=201709_sep17_spl",
      "Impact Factor": 0.555
    },
    {
      "S.No": 50,
      "Authors": "Md Mahadi Hasan, AbdulRehman Hajar, Hesham F. Alharby, Khalid Rehman Hakeem*, Abdulrahaman S. Hajar.",
      "Title": "Leaf Gas Exchange, Fv/Fm Ratio, Ion Content and Growth Conditions of the two Moringa species under Magnetic Water Treatment.",
      "Journal": "Pakistan Journal of Botany",
      "Year": 2017,
      "DOI": "https://pdfs.semanticscholar.org/1115/a7915b8ff03f82a1bbb23060fb142b717aba.pdf?_ga=2.231230303.1729860726.1567662779-1643436248.1540972154",
      "Impact Factor": 0.672
    },
    {
      "S.No": 49,
      "Authors": "Muhammad Abbas Aziz, Hamaad Raza Ahmad, Dennis L. Corwin, Muhammad Sabir, Khalid Rehman Hakeem and Munir Ozturk.",
      "Title": "Influence of farmyard manure on retention and availability of nickel, zinc and lead in metal-contaminated calcareous loam soils.",
      "Journal": "Journal of Environmental Engineering and Landscape Management.",
      "Year": 2017,
      "DOI": "https://www.tandfonline.com/doi/abs/10.3846/16486897.2016.1254639",
      "Impact Factor": 2.233
    },
    {
      "S.No": 48,
      "Authors": "Akram Khan, Yasir Anwar, Md. Mahadi Hasan, Aqib Iqbal, Muhammad Ali, Hesham F. Alharby, Khalid Rehman Hakeem*, and Mirza Hasanuzzaman.",
      "Title": "Attenuation of Drought Stress in Brassica Seedlings with Exogenous Application of Ca2+ and H2O2.",
      "Journal": "Plants",
      "Year": 2017,
      "DOI": "https://www.mdpi.com/2223-7747/6/2/20",
      "Impact Factor": 3.935
    },
    {
      "S.No": 47,
      "Authors": "A.S. Faizalhakim, S. Nurhidayu, K. Norizah, I. Shamsuddin, K.R. Hakeem, I. Adnan.",
      "Title": "Climate variability in relation with land use changes over a 30-year period in Kelantan River Basin.",
      "Journal": "The Malaysian Forester",
      "Year": 2017,
      "DOI": "http://malaysianforester.my/admin/abstract/MF80(1)_P2_abstract.pdf",
      "Impact Factor": "Scopus Indexed"
    },
    {
      "S.No": 46,
      "Authors": "Waseem Mohammed Abdul, Nahid H Hajrah, Jamal SM Sabir, Furkhan Ahmed Mohammed, Salim M.A. El-hamidy, Saleh al Garni, Khalid Rehman Hakeem, Kulvinder Singh Saini, Roop Singh Bora.",
      "Title": "Antibacterial activity of Allium ampeloprasum against ESBL+ve Escherichia coli and methicillin-resistant Staphylococcus aureus by Transmission Electron Microscopy.",
      "Journal": "Journal of Agricultural Biotechnology",
      "Year": 2017,
      "DOI": "http://lawarencepress.com/ojs/index.php/JAB/article/view/480",
      "Impact Factor": null
    },
    {
      "S.No": 45,
      "Authors": "Khalid Rehman Hakeem.",
      "Title": "Climate change and the politics.",
      "Journal": "International Journal of Environmental Science and Natural Resources.",
      "Year": 2017,
      "DOI": "https://juniperpublishers.com/ijesnr/pdf/IJESNR.MS.ID.555695.pdf",
      "Impact Factor": null
    }
],
"2016": [
    {
      "S.No": 44,
      "Authors": "N. Saba, M. Jawaid, K.R. Hakeem, M.T. Paridah, A. Khalina, O.Y. Alothman.",
      "Title": "Potential of bioenergy production from industrial kenaf (Hibiscus cannabinus L) based on Malaysian perspective.",
      "Journal": "Renewable & Sustainable Energy Reviews",
      "Year": 2015,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S1364032114008466",
      "Impact Factor": 14.982
    },
    {
      "S.No": 43,
      "Authors": "Khalid Rehman Hakeem*, Munir Ozturk, Muhammad Sabir, Mohd. Sayeed Akhtar, Faridah Hanum Ibrahim, Muhammad Ashraf, Muhammad Sajid Aqeel Ahmad.",
      "Title": "Nitrate and nitrogen oxides: Sources, health effects and their remediation.",
      "Journal": "Reviews of Environmental Contamination and Toxicology",
      "Year": 2016,
      "DOI": "https://link.springer.com/chapter/10.1007/398_2016_11",
      "Impact Factor": 7.563
    },
    {
      "S.No": 42,
      "Authors": "Volkan Altay, Faruk Karahan, Emre Ilhan, Mustafa Erayman, Munir Öztürk, Khalid Rehman Hakeem.",
      "Title": "Molecular and ecological investigations on the wild populations of Glycyrrhiza L. taxa distributed in the East Mediterranean Area of Turkey.",
      "Journal": "Journal of Plant Research",
      "Year": 2016,
      "DOI": "https://link.springer.com/article/10.1007/s10265-016-0864-6",
      "Impact Factor": 2.629
    },
    {
      "S.No": 41,
      "Authors": "Kaleem Shah, Abu Hena Mustafa Kamal, Daud Adrain, Zamri Rosli, Khalid Rehman Hakeem, Mohd Nesarul Hoque.",
      "Title": "Community awareness about tangible and intangible benefits of Sibuti mangrove forest, Sarawak, Malaysia.",
      "Journal": "The Malaysian Forester",
      "Year": 2016,
      "DOI": "http://malaysianforester.my/admin/content/MF79(1&2)_P11.pdf",
      "Impact Factor": "Scopus Indexed"
    },
    {
      "S.No": 40,
      "Authors": "Shamsudin Ibrahim, Khalid Rehman Hakeem, Faridah Hanum Ibrahim.",
      "Title": "The Development Of Mangrove Quality Index (MQI) In Malaysia.",
      "Journal": "The Malaysian Forester",
      "Year": 2016,
      "DOI": "http://malaysianforester.my/admin/content/MF79(1&2)_P19.pdf",
      "Impact Factor": "Scopus Indexed"
    },
    {
      "S.No": 39,
      "Authors": "Sajad Razvi, Meena Bakshi, S. Nautiyal, Khalid Rehman Hakeem*.",
      "Title": "Seasonal Variation on Rooting Response of Branch Cuttings of Dendrocalamus giganteus: an Improvised Vegetative Propagation Technique.",
      "Journal": "Journal of Bamboo and Rattans",
      "Year": 2016,
      "DOI": "http://www.library.kfri.res.in/JBR/jbr/2015/links/JBR_14(1-4)_11-25.pdf",
      "Impact Factor": "Scopus Indexed"
    },
    {
      "S.No": 38,
      "Authors": "Sadeghi, S.M., Faridah-Hanum, I., Hakeem, K.R., Wan Razali, W.A.",
      "Title": "Structure and carbon storage value of a multi-purpose secondary hill dipterocarp forest after logging.",
      "Journal": "Malayan Nature Journal",
      "Year": 2016,
      "DOI": "",
      "Impact Factor": "Scopus Indexed"
    },
    {
      "S.No": 37,
      "Authors": "S. M. Sadeghi, I. Faridah-Hanum, A. Abdu, K. Abd Kudus, K.R. Hakeem*, M. Ozturk.",
      "Title": "Recovery of Soil in Hill Dipterocarp Forest after Logging in Kedah, Malaysia.",
      "Journal": "Malayan Nature Journal",
      "Year": 2016,
      "DOI": "",
      "Impact Factor": "Scopus Indexed"
    },
    {
      "S.No": 36,
      "Authors": "Mohd Sayeed Akhtar, Akil Ahmad Khan, Mallappa Kumara Swamy, Khalid Rehman Hakeem.",
      "Title": "Impact of metal nanoparticles on the morphological and physiological changes in plants: A review.",
      "Journal": "Frontiers in Nano science and Nanotechnology",
      "Year": 2016,
      "DOI": "10.15761/FNN.1000112",
      "Impact Factor": null
    },
    {
      "S.No": 35,
      "Authors": "Aijaz Ahmad, Syed Mudasir Razvi, Manzor Ahmad Rather, Mushtaq Ahmad, Gul Zaffar, Shabeer Ahmad Ganie, Mohmad Ramzan Mir, Khalid Rehman Hakeem*.",
      "Title": "Estimation of Genetic Divergence in Mung Bean (Vigna radiata L.) under Temperate Ecology of Kashmir, India.",
      "Journal": "Journal Botanical Sciences",
      "Year": 2016,
      "DOI": "http://www.rroij.com/open-access/estimation-of-genetic-divergence-in-mung-bean-vigna-radiata-lunder-temperate-ecology-of-kashmir-.pdf",
      "Impact Factor": null
    },
    {
      "S.No": 34,
      "Authors": "Sartaj A Wani, M Nayeem Sofi, Subhash Chand, Khalid Rehman Hakeem*.",
      "Title": "Soil Carbon Sequestration: As a Climate Change Adaptation and Mitigation Strategy - An Overview.",
      "Journal": "International Journal of Plant, Animal and Environmental Science",
      "Year": 2016,
      "DOI": "http://www.ijpaes.com/admin/php/uploads/929_pdf.pdf",
      "Impact Factor": null
    }
],
  "2015": [
    {
      "S.No": 33,
      "Authors": "Ibrahim M Aref, Pervaiz R Khan, Said S Hegazy, Hashim El-Atta, Azamal Husen, MKA Ansari, Altaf Ahmad, Muhammad Iqbal and Khalid R Hakeem",
      "Title": "Improving the phytoextraction capacity of plants to scavenge metal(loid)-contaminated sites",
      "Journal": "Environmental Reviews",
      "Year": 2015,
      "DOI": "https://www.nrcresearchpress.com/doi/abs/10.1139/er-2014-0043?journalCode=er#.XXC9Mi4zaM8",
      "Impact Factor": 5.212
    },
    {
      "S.No": 32,
      "Authors": "Tariq Ahmad Dar, Moin Uddin, M. Masroor A. Khan, K. R. Hakeem, Hassan jaleel",
      "Title": "Jasmonates counter plant stress: A Review",
      "Journal": "Environmental and Experimental Botany",
      "Year": 2015,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0098847215000398",
      "Impact Factor": 5.545
    },
    {
      "S.No": 31,
      "Authors": "Sobia Ashraf, Farhat Abbas, Muhammad Ibrahim, Umer Rashid, Shoaib Khalid Hammad Raza Ahmad, Khalid Rehman Hakeem",
      "Title": "Application of Geographical Information System (GIS) for the Identification and Demarcation of Selective Heavy Metal Concentrations in the Groundwater of a Metropolitan City",
      "Journal": "Journal of Geographical Science",
      "Year": 2015,
      "DOI": "https://link.springer.com/article/10.1007/s11442-015-1164-0",
      "Impact Factor": 3.534
    },
    {
      "S.No": 30,
      "Authors": "Kaleem Shah, Abu Hena Mustafa Kamal, Zamri Bin Rosli, Khalid Rehman Hakeem and Hoque M M",
      "Title": "Plant Composition and Diversity of Sibuti Mangrove Forest, Sarawak, Malaysia",
      "Journal": "Forest Science and Technology",
      "Year": 2015,
      "DOI": "https://www.tandfonline.com/doi/full/10.1080/21580103.2015.1057619",
      "Impact Factor": "Scopus Indexed"
    },
    {
      "S.No": 29,
      "Authors": "S.A. Ganie, M. Y. Ghani, Ashiq Hussain Lone, S.M. Razvi, M.R Mir, K.R Hakeem",
      "Title": "Role of Weather Factors on Early Blight of Potato under Kashmir Valley Conditions",
      "Journal": "Molecular Plant Breeding",
      "Year": 2015,
      "DOI": "http://biopublisher.ca/index.php/mpb/article/html/1625/",
      "Impact Factor": "Scopus Indexed"
    }
  ],
  "2014": [
    {
      "S.No": 28,
      "Authors": "Bilal Ahmad Mir, Jabeena Khizar, Khalid Rehman Hakeem, Arun Kumar and Sushma Koul",
      "Title": "Withanolides array of Withania ashwagandha sp. novo populations from India",
      "Journal": "Industrial Crops and Products",
      "Year": 2014,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0926669014002271",
      "Impact Factor": 5.645
    },
    {
      "S.No": 27,
      "Authors": "Sowbiya Muneer, Khalid Rehman Hakeem, Rozi Mohamed and Jeong Hyun Lee",
      "Title": "Cadmium toxicity induced alterations in the root proteome of green gram in contrasting response towards iron supplement",
      "Journal": "International Journal of Molecular Science",
      "Year": 2014,
      "DOI": "http://www.mdpi.com/resolver?pii=ijms15046343",
      "Impact Factor": 5.923
    },
    {
      "S.No": 26,
      "Authors": "Muhammad Sabir, Amanat Ali, Muhammad Zia-ur-Rehman and Khalid Rehman Hakeem",
      "Title": "Contrasting effects of farmyard manure (FYM) and compost for remediation of metal contaminated soil",
      "Journal": "International Journal of Phytoremediation",
      "Year": 2014,
      "DOI": "https://www.tandfonline.com/doi/full/10.1080/15226514.2014.898019",
      "Impact Factor": 3.212
    },
    {
      "S.No": 25,
      "Authors": "Bilal Ahmad Mir, Jabeena Khazir, Khalid R Hakeem, Sushma Koul and Don A. Cown",
      "Title": "Enhanced production of withaferin-A in shoot cultures of Withania somnifera (L) Dunal",
      "Journal": "Journal of Plant Biochemistry and Biotechnology",
      "Year": 2014,
      "DOI": "https://link.springer.com/article/10.1007/s13562-014-0264-8",
      "Impact Factor": 1.175
    },
    {
      "S.No": 24,
      "Authors": "Muhammad Sabir, Tariq Aziz, Khalid Rehman Hakeem, Hammad Khan, Munir Ozturk and Muhammad Zia-Ur-Rehman",
      "Title": "Ameliorative effect of calcium on the nickel toxicity in rice grown with different levels of nickel",
      "Journal": "CLEAN – Soil, Air, Water",
      "Year": 2014,
      "DOI": "https://research-repository.uwa.edu.au/en/publications/alleviating-effect-of-calcium-on-nickel-toxicity-in-rice",
      "Impact Factor": 1.603
    },
    {
      "S.No": 23,
      "Authors": "Harmaen Ahmad Saffian, Paridah Md Tahir, Jalaluddin Harun, Mohammad Jawaid, Khalid Rehman Hakeem",
      "Title": "Influence of planting density on fibre morphology and chemical composition of new latex-timber clone tree of rubberwood (hevea brasiliensis muell.arg.)",
      "Journal": "Bioresources",
      "Year": 2014,
      "DOI": "https://bioresources.cnr.ncsu.edu/resources/influence-of-planting-density-on-the-fiber-morphology-and-chemical-composition-of-a-new-latex-timber-clone-tree-of-rubberwood-hevea-brasiliensis-muell-arg/",
      "Impact Factor": 1.396
    },
    {
      "S.No": 22,
      "Authors": "Syuharni AW, Hakeem KR, Faridah-Hanum, Alias MS, Ozturk M",
      "Title": "Floral ecology of Coastal Heath Forest - A Case Study from Terengganu, Malaysia",
      "Journal": "Emiratus Journal of Food and Agriculture",
      "Year": 2014,
      "DOI": "https://www.ejfa.me/index.php/journal/article/view/626",
      "Impact Factor": 1.040
    },
    {
      "S.No": 21,
      "Authors": "Sabir, M., M.M. Hanafi, M.Z. Rehman, Saifullah, H.R. Ahmad, K. R. Hakeem and T. Aziz",
      "Title": "Comparison of Low Molecular Weight Organic Acids and Ethylene Diamine Tetra Acetic Acid to Enhance Phyto-extraction of Heavy Metals by maize (Zea mays L.)",
      "Journal": "Communications in Soil Science and Plant Analysis",
      "Year": 2014,
      "DOI": "https://www.tandfonline.com/doi/full/10.1080/00103624.2013.848879",
      "Impact Factor": 1.327
    },
    {
      "S.No": 20,
      "Authors": "Seyed Mousa Sadeghi, Faridah Hanum Ibrahim, Wan Razali Wan Mohd, Kamziah Abd Kudus, Arifin Abdu and Khalid Rehman Hakeem",
      "Title": "Tree Composition and Diversity of a Hill Dipterocarp Forest after Logging",
      "Journal": "Malayan Nature Journal",
      "Year": 2014,
      "DOI": "http://www.myjurnal.my/public/article-view.php?id=93673",
      "Impact Factor": null
    },
    {
      "S.No": 19,
      "Authors": "Sajad Razvi, S Nautiyal, Rakesh Prakash, S.M. Razvi and Khalid Rehman Hakeem",
      "Title": "Vegetative Propagation of Bauhinia purpurea L. through softwood branch cuttings",
      "Journal": "The Malaysian Forester",
      "Year": 2014,
      "DOI": "http://psasir.upm.edu.my/id/eprint/35980/",
      "Impact Factor": null
    },
    {
      "S.No": 18,
      "Authors": "Mohammad Asim, Sangeeta Gupta, Mohammad Jawaid, Mohammed Nasir, Khalid Rehman Hakeem",
      "Title": "Impact of site on the wood anatomical features in Lagerstroemia speciosa (L.) Pers",
      "Journal": "The Malaysian Forester",
      "Year": 2014,
      "DOI": "http://psasir.upm.edu.my/id/eprint/34249/",
      "Impact Factor": null
    }
  ],
  "2013": [
    {
      "S.No": 17,
      "Authors": "Khalid Rehman Hakeem*, Bilal Ahmad Mir, Mohd. Irfan Qureshi, Altaf Ahmad, Muhammad Iqbal",
      "Title": "Proteomic analysis for differentially expressed proteins and their role in the root of N-efficient rice (Oryza sativa L.)",
      "Journal": "Molecular Breeding",
      "Year": 2013,
      "DOI": "https://link.springer.com/article/10.1007/s11032-013-9906-0",
      "Impact Factor": 2.589
    },
    {
      "S.No": 16,
      "Authors": "Muhammad Sabir, Khalid Rehman Hakeem*, Tariq Aziz, Muhammad Zia-ur Rehman, Irfan Rashid and Munir Ozturk",
      "Title": "Higher Ni levels could modify growth response and mineral composition of wheat (Triticum aestivum) cultivars grown in contaminated soil",
      "Journal": "CLEAN – Soil, Air, Water",
      "Year": 2013,
      "DOI": "https://onlinelibrary.wiley.com/doi/full/10.1002/clen.201300352",
      "Impact Factor": 1.603
    },
    {
      "S.No": 15,
      "Authors": "Muhammad Sabir, Mohamed Musa Hanafi, M. Tahir Malik, Tariq Aziz, Muhammad Zia-ur-Rehman, Hamaad Raza Ahmad, Khalid Rehman Hakeem and Muhammad Shahid",
      "Title": "Differential effect of nitrogen forms on physiological parameters and micronutrient concentration in maize (Zea mays L.)",
      "Journal": "Australian Journal of Crop Science",
      "Year": 2013,
      "DOI": "http://www.cropj.com/sabir_7_12_2013_1836_1842.pdf",
      "Impact Factor": 1.632
    },
    {
      "S.No": 14,
      "Authors": "Faheema Khan, Khalid Rehman Hakeem*, T. O. Sidiqqui & Altaf Ahmad",
      "Title": "RAPD markers associated with salt tolerance in Soybean genotypes under salt stress",
      "Journal": "Applied Biochemistry and Biotechnology",
      "Year": 2013,
      "DOI": "https://link.springer.com/article/10.1007/s12010-013-0182-6",
      "Impact Factor": 2.926
    },
    {
      "S.No": 13,
      "Authors": "Rudi Dungani, H. P. S. Abdul Khalil, M. Jawaid, Jasni, Sri Aprilia, K. R. Hakeem, Sri Hartali and M.N Islam",
      "Title": "A review on quality enhancement of oil palm trunk waste by Resin Impregnation: Future Material",
      "Journal": "Bioresources",
      "Year": 2013,
      "DOI": "https://ojs.cnr.ncsu.edu/index.php/BioRes/article/view/BioRes_08_2_3136_Dungani_Review_Quality_Enhancement_Palm_Waste",
      "Impact Factor": 1.396
    },
    {
      "S.No": 12,
      "Authors": "Ahmad R. Norhisham, Faizah Abood, Mohamad Rita, Khalid Rehman Hakeem*",
      "Title": "Effect of humidity on egg hatchability and reproductive biology of the Bamboo Borer (Dinoderus minutus Fabricius)",
      "Journal": "SpringerPlus",
      "Year": 2013,
      "DOI": "https://springerplus.springeropen.com/articles/10.1186/2193-1801-2-9",
      "Impact Factor": 0.982
    },
    {
      "S.No": 11,
      "Authors": "Sabir, M., M.M. Hanafi, T. Aziz, H.R. Ahmad, M.Z. Rehman, Saifullah, G. Murtaza and K.R. Hakeem",
      "Title": "Comparative Effect of Activated Carbon, Pressmud and Poultry Manure on Immobilization of Metals, Concentration and Accumulation by Maize (Zea mays L.) Grown in Contaminated Soil",
      "Journal": "International Journal of Agriculture and Biology",
      "Year": 2013,
      "DOI": "http://agris.fao.org/agris-search/search.do?recordID=PK2013000732",
      "Impact Factor": 0.802
    },
    {
      "S.No": 10,
      "Authors": "Mohd Nizar Mardan, I. Faridah-Hanum, Khalid Rehman Hakeem*, Nurul Shida Saari, Munir Ozturk",
      "Title": "Tree species composition and diversity for one-hectare of Ulu Muda Forest Reserve, Kedah",
      "Journal": "Sains Malaysiana",
      "Year": 2013,
      "DOI": "http://journalarticle.ukm.my/6542/",
      "Impact Factor": 0.540
    },
    {
      "S.No": 9,
      "Authors": "S. Nurul-Shida, I. Faridah-Hanum & Khalid Rehman Hakeem",
      "Title": "Towards The Establishment Of Flora Database In Ayer Hitam Forest Reserve (AHFR) Puchong, Selangor, Malaysia: A Review",
      "Journal": "The Malaysian Forester",
      "Year": 2013,
      "DOI": "https://www.researchgate.net/publication/263776294_Towards_the_establishment_of_flora_database_in_Ayer_Hitam_Forest_Reserve_AHFR_Puchong_Selangor_Malaysia_A_review",
      "Impact Factor": null
    }
  ],
  "2012": [
    {
      "S.No": 8,
      "Authors": "Muhammad Afzal, Gaurau Gupta, Imran Kazmi, Mahfoozur Rehman, Obaiz Afzal, Jahangir Alam, Khalidur Rehman Hakeem, Mohammad Pravez, Ritu Gupta, Firoz Anwar",
      "Title": "Anti-inflammatory and analgesic potential of a novel steroidal derivative from Bryophyllum pinnatum",
      "Journal": "Fitoterapia",
      "Year": 2012,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S0367326X12000792?via%3Dihub",
      "Impact Factor": 2.500
    },
    {
      "S.No": 7,
      "Authors": "Khalid Rehman Hakeem*, Ruby Chandna, Altaf Ahmad, M. Irfan Qureshi & Muhammad Iqbal",
      "Title": "Proteomic analysis for low and high nitrogen responsive proteins in the leaves of rice genotypes grown at three nitrogen levels",
      "Journal": "Applied Biochemistry and Biotechnology",
      "Year": 2012,
      "DOI": "https://dx.doi.org/10.1007/s12010-012-9823-4",
      "Impact Factor": 3.100
    },
    {
      "S.No": 6,
      "Authors": "Khalid Rehman Hakeem*, Faheema Khan, Ruby Chandna, Tariq Omer Siddiqui & Muhammad Iqbal",
      "Title": "Genotypic variability among soybean genotypes under NaCl stress and proteome analysis of salt tolerant genotype",
      "Journal": "Applied Biochemistry and Biotechnology",
      "Year": 2012,
      "DOI": "https://www.ncbi.nlm.nih.gov/pubmed/23090685",
      "Impact Factor": 2.926
    },
    {
      "S.No": 5,
      "Authors": "Ruby Chandna, Khalid Rehman Hakeem*, Faheema Khan, Altaf Ahmad & Muhammad Iqbal",
      "Title": "Variability of nitrogen uptake and assimilation among N-efficient and N-inefficient Wheat (Triticum aestivum L.) genotypes",
      "Journal": "Journal of Plant Interaction",
      "Year": 2012,
      "DOI": "https://www.tandfonline.com/doi/full/10.1080/17429145.2011.641229",
      "Impact Factor": 2.600
    },
    {
      "S.No": 4,
      "Authors": "Parvaiz Ahmad, Muhammad Ashraf, Khalid Rehman Hakeem, Muhammad Mahgoub Azooz, Saiema Rasool, Ruby Chandna & Nudrat Aisha Akram",
      "Title": "Potassium starvation-induced oxidative stress and antioxidant defense responses in Brassica juncea",
      "Journal": "Journal of Plant Interaction",
      "Year": 2012,
      "DOI": "https://www.tandfonline.com/doi/full/10.1080/17429145.2012.747629",
      "Impact Factor": 2.600
    },
    {
      "S.No": 3,
      "Authors": "Parvaiz Ahmad, Khalid ul Rehman Hakeem, Ashwani Kumar, Muhammad Ashraf & Nudrat Aisha Akram",
      "Title": "Salt-induced changes in photosynthetic activity and oxidative defense system of three cultivars of mustard (Brassica juncea L.)",
      "Journal": "African Journal of Biotechnology",
      "Year": 2012,
      "DOI": "https://academicjournals.org/journal/AJB/article-abstract/E9AA3E132081",
      "Impact Factor": 0.573
    },
    {
      "S.No": 2,
      "Authors": "Khalid Rehman Hakeem*, Ruby Chandna, Altaf Ahmad, Muhammad Iqbal",
      "Title": "Physiological and molecular analysis of applied nitrogen in rice (Oryza sativa L.) genotypes",
      "Journal": "Rice Science",
      "Year": 2012,
      "DOI": "https://www.sciencedirect.com/science/article/pii/S1672630812600432",
      "Impact Factor": 5.600
    }
  ],
  "2011": [
    {
      "S.No": 1,
      "Authors": "Khalid Rehman Hakeem*, Altaf Ahmad, Muhammad Iqbal, Salih Gucel and Munir Ozturk",
      "Title": "Nitrogen efficient rice cultivars can reduce nitrate pollution",
      "Journal": "Environmental Science and Pollution Research",
      "Year": 2011,
      "DOI": "https://link.springer.com/article/10.1007/s11356-010-0434-8",
      "Impact Factor": 4.223
    }
  ]
}
